#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_TArray.h"
#include "BasicTypes_FName.h"
#include "BasicTypes_UScriptDelegate.h"
#include "AnnouncerAttachments_ENUMS.h"
#include "AnnouncerGestures_ENUMS.h"
#include "CoreUObject_FVector.h"
#include "AnnouncerExpression_ENUMS.h"
#include "AnnouncerSequence_FAnnouncerSequence.h"
#include "DelayedExpression_FDelayedExpression.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::MediaAssets { class UMediaSource; };
namespace CG::Engine { class USoundWave; };
namespace CG::Engine { class USoundBase; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Announcer_BP
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_UpdateReflectionMap_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_ChooseBallType_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_PlayPairedSequences_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FName>                        PairedSequences;                                         //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        BasicTypes::UScriptDelegate                                  SequencesCompleteEvent;                                  //  0x0010(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_RemoveAttachements_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_AttachObjectToHand_Params
    {
    public:
        AnnouncerAttachments::EAnnouncerAttachments                  Attachment;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_StartLogoTransform_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_PlayGesture_Params
    {
    public:
        AnnouncerGestures::EAnnouncerGestures                        Gesture;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_UpdateEnvelope_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_PlayClipsByNameSequence_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FName>                        SequenceList;                                            //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_PlayClipByName_Params
    {
    public:
        BasicTypes::FName                                            SequenceName;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_SetBallTexture_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_SetWhiteTexture_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_PlayPowerSFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_TimelineTransitionAlpha__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_TimelineTransitionAlpha__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_Timeline_VideoScreenAlpha__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_Timeline_VideoScreenAlpha__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_Timeline_HideStatic__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_Timeline_HideStatic__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_MoveForwardComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_ExitSequence_Params
    {
    public:
        bool                                                         InHub;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_PairedSequenceLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_GestureLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_AudioLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_GestureTimerComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_PairedSequenceTimerComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_GestureInSequenceComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_AudioSequenceTimerComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_ClipInSequenceComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_SecretEffect_Params
    {
    public:
        CoreUObject::FVector                                         Loc;                                                     //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_HubExit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_HideMesh_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_HideEyes_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_ShowEyes_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_PlayVideo_Params
    {
    public:
        MediaAssets::UMediaSource*                                   MediaSource;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Loop;                                                    //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        DurationOverride;                                        //  0x000C(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_ShowFace_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_HideFace_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_FirstVideoSequence_Params
    {
    public:
        MediaAssets::UMediaSource*                                   MediaSource;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Loop;                                                    //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0003[0x3];                                   //  0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        DurationOverride;                                        //  0x000C(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_PlayVideoSequence_Params
    {
    public:
        BasicTypes::TArray<MediaAssets::UMediaSource*>               MediaSources;                                            //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        BasicTypes::TArray<float>                                    DurationOverrides;                                       //  0x0010(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_SequenceLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_FadeOutStatic_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_BlobShow_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_BlobHide_Params
    {
    public:
        float                                                        Delay;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_BndEvt__AudioCurveSource_K2Node_ComponentBoundEvent_2_OnAudioSingleEnvelopeValue__DelegateSignature_Params
    {
    public:
        Engine::USoundWave*                                          PlayingSoundWave;                                        //  0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        float                                                        EnvelopeValue;                                           //  0x0008(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_ChangeExpression_Params
    {
    public:
        AnnouncerExpression::EAnnouncerExpression                    NewExpression;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_PlayAudioWithExpression_Params
    {
    public:
        AnnouncerSequence::FAnnouncerSequence                        AnnouncerSequence;                                       //  0x0000(0x0028)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_StartExpressionLoop_Params
    {
    public:
        BasicTypes::TArray<DelayedExpression::FDelayedExpression>    ExpressionSequence;                                      //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_PlayAudio_Params
    {
    public:
        Engine::USoundBase*                                          Sound;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_VoiceFinished_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_DoExpressionSwap_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_TransformLogoToIdle_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_PlayClipSequence_Params
    {
    public:
        BasicTypes::TArray<AnnouncerSequence::FAnnouncerSequence>    ClipSequence;                                            //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_BlinkLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_BndEvt__AudioVoice_K2Node_ComponentBoundEvent_0_OnAudioFinished__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_Relay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_RemoveAnnouncer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_FadeInStatic_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_UpdateAttachments_Params
    {
    public:
        AnnouncerAttachments::EAnnouncerAttachments                  Attachement;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_EntryComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_DoNothin_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_LevelChanged_Params
    {
    public:
        BasicTypes::FName                                            NewPrimaryLevel;                                         //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_GeoLevelChanged_Params
    {
    public:
        BasicTypes::FName                                            NewGeoLevel;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_ExecuteUbergraph_Announcer_BP_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_ExitSequenceComplete__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_PairedSequencesComplete__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_TransformFromLogoComplete__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_VoiceClipSequenceComplete__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_EyeHideComplete__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AAnnouncer_BP_C_VoiceClipComplete__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
