#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "SportsScramble_FChance.h"
#include "SportsScramble_ENUMS.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::SportsScramble { class ABaseballMitt; };
namespace CG::SportsScramble { class ABaseballBall; };
namespace CG::BB_Ball_Base { class ABB_Ball_Base_C; };
namespace CG::Engine { class UTexture2D; };
namespace CG::SportsScramble { class ABaseballPitchingTarget; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BaseballBallSelector_BP
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_HasScrambleOption_Params
    {
    public:
        SportsScramble::ABaseballMitt*                               Mitt;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::ABaseballBall*                               BallClass;                                               //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         HasOption;                                               //  0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_BB_Training_GetBallVO_Params
    {
    public:
        BB_Ball_Base::ABB_Ball_Base_C*                               BallClass;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_GetIconLocations_Params
    {
    public:
        bool                                                         TL;                                                      //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         TR;                                                      //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         BL;                                                      //  0x0002(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         BR;                                                      //  0x0003(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_GetImbuingOdds_Params
    {
    public:
        SportsScramble::FChance                                      ImbueChance;                                             //  0x0000(0x0004)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_ShowAllTarget_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_GetNumToSpawn_Params
    {
    public:
        int32_t                                                      SpawnNumber;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_CanSpawnBalls_Params
    {
    public:
        bool                                                         CanSpawn;                                                //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_BB_TNG_SpawnBlankTargets_Params
    {
    public:
        bool                                                         BindOnHit;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_BB_TNG_BlinkTargets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_BB_TNG_CleanUpDemoTargets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_HitTrainingTarget_01_Params
    {
    public:
        SportsScramble::EBaseballScrambleTargetLocations             Location;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_BB_TNG_TrackTargetHits_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_HitTrainingTarget_02_Params
    {
    public:
        SportsScramble::EBaseballScrambleTargetLocations             Location;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_HitTrainingTarget_03_Params
    {
    public:
        SportsScramble::EBaseballScrambleTargetLocations             Location;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_HitTrainingTarget_04_Params
    {
    public:
        SportsScramble::EBaseballScrambleTargetLocations             Location;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_BB_TNG_RM03_SpawnInitialIcons_Params
    {
    public:
        SportsScramble::ABaseballBall*                               BB_BallClass;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::EBaseballBallType                            BB_BallType;                                             //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::UTexture2D*                                          BB_BallIcon;                                             //  0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        float                                                        imbueChance;                                             //  0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_BB_TNG_RM03_CleanUpAllButFrisbee_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_CustomEvent_Params
    {
    public:
        SportsScramble::EBaseballScrambleTargetLocations             Location;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_BB_TNG_GiveMittScrambleBall_Params
    {
    public:
        SportsScramble::ABaseballBall*                               BallClass;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Imbued;                                                  //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_BB_TNG_RM03_SingleIcon_Params
    {
    public:
        SportsScramble::ABaseballBall*                               BB_BallClass;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::EBaseballBallType                            BB_BallType;                                             //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::UTexture2D*                                          BB_BallIcon;                                             //  0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        float                                                        imbueChance;                                             //  0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::EBaseballScrambleTargetLocations             Location;                                                //  0x001C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_IndividualTargetHit_Params
    {
    public:
        SportsScramble::EBaseballScrambleTargetLocations             Location;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_ReadyBalls_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_ChangeRound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_ResolveAndClear_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_SendThroughBall_Params
    {
    public:
        SportsScramble::ABaseballPitchingTarget*                     NewParam;                                                //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_ExecuteUbergraph_BaseballBallSelector_BP_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_TrainingTargetHit__DelegateSignature_Params
    {
    public:
        SportsScramble::EBaseballScrambleTargetLocations             Location;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballBallSelector_BP_C_TargetsUpdated__DelegateSignature_Params
    {
    public:
        bool                                                         TL;                                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         TR;                                                      //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         BL;                                                      //  0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         BR;                                                      //  0x0003(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
