#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "SlateCore_FSlateColor.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::BB_Ball_Base { class ABB_Ball_Base_C; };
namespace CG::SportsScramble { class AScramBall; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BaseballPracticeArenaLight
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_FlashScore_Params
    {
    public:
        int32_t                                                      score;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        SlateCore::FSlateColor                                       Color;                                                   //  0x0008(0x0028)  (BlueprintVisible, BlueprintReadOnly, Parm)
        bool                                                         ScoreFlashed;                                            //  0x0030(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_HideBallTarget_Params
    {
    public:
        bool                                                         Instant;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Callback;                                                //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_ShowBallTarget_Params
    {
    public:
        bool                                                         Instant;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Callback;                                                //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_ResetTarget_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_DeactivateEverything_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_BreakLightFixture_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_ScorePlayerHit_Params
    {
    public:
        BB_Ball_Base::ABB_Ball_Base_C*                               Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_CleanupTarget_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_ResetLightFixture_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_Deactivate_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_OnTriggered_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_ExecuteUbergraph_BaseballPracticeArenaLight_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_PlayerBrokeLightFixture__DelegateSignature_Params
    {
    public:
        BB_Ball_Base::ABB_Ball_Base_C*                               Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ScoreAmount;                                             //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballPracticeArenaLight_C_LightFixtureHitDetected__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
