#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "SportsScramble_FAvatarLook.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::SportsScramble { class ABaseballBall; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BaseballAIPitcher_Blueprint
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballAIPitcher_Blueprint_C_SetGloveColor_Params
    {
    public:
        bool                                                         Home;                                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballAIPitcher_Blueprint_C_SetLook_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballAIPitcher_Blueprint_C_RandomizeLook_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballAIPitcher_Blueprint_C_GetScrambleBallClass_Params
    {
    public:
        SportsScramble::ABaseballBall*                               Ball;                                                    //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballAIPitcher_Blueprint_C_SetTeamColor_Params
    {
    public:
        bool                                                         Home;                                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballAIPitcher_Blueprint_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballAIPitcher_Blueprint_C_PlayMittSound_Params
    {
    public:
        SportsScramble::ABaseballBall*                               Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        float                                                        BallSpeed;                                               //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballAIPitcher_Blueprint_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballAIPitcher_Blueprint_C_ExecuteUbergraph_BaseballAIPitcher_Blueprint_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABaseballAIPitcher_Blueprint_C_LookRandomized__DelegateSignature_Params
    {
    public:
        SportsScramble::FAvatarLook                                  AvatarLook;                                              //  0x0000(0x0020)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
