#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::SportsScramble { class AScramBall; };
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BattingTee
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_OnRep_AutoActivateDeactivate_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_RemoveInstructions_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_SpawnInstructions_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_HideBallUnderFloor_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_OnRep_Ball_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Pole_2_Rise__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Pole_2_Rise__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Pole_1_Rise__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Pole_1_Rise__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Base_Rise__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Base_Rise__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_HomePlateAnimate__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_HomePlateAnimate__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Timeline_FakeBallAppear__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Timeline_FakeBallAppear__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_MoveBallUnderHomeplate_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         AutoActivateAndDeactivate;                               //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_BallGrabbed_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_ReleaseBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_TeedBallHit_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_BallHit_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_AllowHit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Pole_2_Up_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_DeactivateTee_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Pole_1_Up_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Pole_1_Down_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Base_Up_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_Base_Down_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_ActivateTee_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_HomePlate_Close_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_GenerateBattingTeeBall_Params
    {
    public:
        SportsScramble::AScramBall*                                  ScramBallClass;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         AutoActivateAndDeactivate;                               //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_RegisterBallBindings_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_FakeBallAppear_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_ExecuteUbergraph_BattingTee_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0xC];                                   //  0x0004(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_TeeDeactivated__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_TeeBallAwaitingHit__DelegateSignature_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABattingTee_C_TeeBallHit__DelegateSignature_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
