#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FName.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AActor; };
namespace CG::BB_Ball_Base { class ABB_Ball_Base_C; };
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BB_Challenge_04_ChinaShop
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_SetUpInfoText_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_LaunchBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_UpdateLauncherSpeeds_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_UpdateBallType_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_UpdateScoreAndBoard_Params
    {
    public:
        int32_t                                                      AdditionalScore;                                         //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_GrabInstrument_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_SpawnElements_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_Cleanup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_BallLaunched_Params
    {
    public:
        Engine::AActor*                                              NewBallActor;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_ActorBroken_Params
    {
    public:
        BB_Ball_Base::ABB_Ball_Base_C*                               Baseball;                                                //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      WindowScore;                                             //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_GameLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_OnBallHit_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_AnnouncerPaused_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_AnnouncerPresenting_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_AnnouncerPlayingSequence_Params
    {
    public:
        BasicTypes::FName                                            SequenceName;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_BB_TriggerCountdown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_EndGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_Start_Game_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_AnnouncerExitSequenceComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_Shortcut_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Challenge_04_ChinaShop_C_ExecuteUbergraph_BB_Challenge_04_ChinaShop_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
