#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FString.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Pitching_Target_02 { class APitching_Target_02_C; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BB_PitchTarget
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_HideAvatar_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_SetAllTargetsUnbroken_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_DisableTargets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_SetTargetVisibility_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_PickNewRandomTarget_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_ResetTargets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_ValidateTargets_Params
    {
    public:
        Pitching_Target_02::APitching_Target_02_C*                   TargetActor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Validation;                                              //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_ShowDebugText_Params
    {
    public:
        BasicTypes::FString                                          String;                                                  //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
        float                                                        Duration;                                                //  0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_MaintainTargets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_ResetAllTargets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_Target_5_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_Target_4_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_Target_2_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_ResetDoubleHit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_Target_3_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_PickRandomTarget_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_SpawnInitialRandomTarget_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_ShrinkAndPickNewTarget_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_ExecuteUbergraph_BB_PitchTarget_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_TargetHit__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_PitchTarget_C_UpdateScoreboardScore__DelegateSignature_Params
    {
    public:
        int32_t                                                      ScoreAmount;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
