#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "SlateCore_FSlateFontInfo.h"
#include "BasicTypes_FText.h"
#include "UMG_ENUMS.h"
#include "BB_ScoreboardVideos_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class UMaterialInterface; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BB_Scoreboard_Large_BP
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BBVideo_StartTimer_Params
    {
    public:
        int32_t                                                      Seconds;                                                 //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         complete;                                                //  0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BBVideoScoreFontAndMaterial_Params
    {
    public:
        Engine::UMaterialInterface*                                  Material;                                                //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SlateCore::FSlateFontInfo                                    Font;                                                    //  0x0008(0x0058)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
        bool                                                         complete;                                                //  0x0060(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BBVideo_UpdateScore_Params
    {
    public:
        BasicTypes::FText                                            Text;                                                    //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        bool                                                         complete;                                                //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BBVideo_HideShowScoreAndTimer_Params
    {
    public:
        UMG::ESlateVisibility                                        Visibility;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Completed;                                               //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BBVideo_HideShowCenterText_Params
    {
    public:
        UMG::ESlateVisibility                                        Visibility;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Completed;                                               //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x6];                                   //  0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BBVideo_ChangeFontAndMaterial_Params
    {
    public:
        Engine::UMaterialInterface*                                  Material;                                                //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SlateCore::FSlateFontInfo                                    Font;                                                    //  0x0008(0x0058)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
        bool                                                         FontChanged;                                             //  0x0060(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BB_UpdatePlayerNames_Params
    {
    public:
        bool                                                         PlayerIsHomeTeam;                                        //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Callback;                                                //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BBVideo_PlayAnimation_Params
    {
    public:
        BB_ScoreboardVideos::EBB_ScoreboardVideos                    Animation;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         AnimationStarted;                                        //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BBGame_UpdateGameScore_Params
    {
    public:
        int32_t                                                      Player1Score;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Player2Score;                                            //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         ScoreUpdated;                                            //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_MG_ClearAllMGText_Params
    {
    public:
        bool                                                         TextCleared;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_MG_ClearBottomText_Params
    {
    public:
        bool                                                         TextCleared;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_MG_SetBottomText_Params
    {
    public:
        BasicTypes::FText                                            Text;                                                    //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        bool                                                         TextSet;                                                 //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_MG_ClearCenterText_Params
    {
    public:
        bool                                                         TextCleared;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_MG_SetCenterText_Params
    {
    public:
        BasicTypes::FText                                            Text;                                                    //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        bool                                                         TextSet;                                                 //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_MG_ShowCenterDisplay_Params
    {
    public:
        bool                                                         DisplayShown;                                            //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_MG_ClearDistanceScore_Params
    {
    public:
        bool                                                         ScoreHidden;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_MG_StopCountDown_Params
    {
    public:
        bool                                                         CountDownStopped;                                        //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_MG_HideCenterDisplay_Params
    {
    public:
        bool                                                         CenterDisplayHidden;                                     //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_MG_BeginCountDown_Params
    {
    public:
        int32_t                                                      Seconds;                                                 //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         CountdownStarted;                                        //  0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_MG_SetDistanceScore_Params
    {
    public:
        float                                                        Distance;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         DistanceUpdated;                                         //  0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BBGame_UpdateOuts_Params
    {
    public:
        int32_t                                                      Freebees;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Outs;                                                    //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Strikes;                                                 //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         OutsUpdated;                                             //  0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BBGame_UpdateBaserunners_Params
    {
    public:
        bool                                                         RunnerOn1;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         RunnerOn2;                                               //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         RunnerOn3;                                               //  0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         RunnersUpdated;                                          //  0x0003(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BBGame_Deactivate_Params
    {
    public:
        bool                                                         BBGameDeactivate;                                        //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BBGame_Activate_Params
    {
    public:
        int32_t                                                      BallsCount;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      StrikesCount;                                            //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         GameActivated;                                           //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BBGame_NewInning_Params
    {
    public:
        int32_t                                                      Inning;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Top;                                                     //  0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         InningUpdated;                                           //  0x0005(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_SetCountDownTime_Params
    {
    public:
        int32_t                                                      Seconds;                                                 //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0003[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_Timeline_LogoLoop__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_Timeline_LogoLoop__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_Timeline_Countdown__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_Timeline_Countdown__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_Timeline_StrikeOut__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_Timeline_StrikeOut__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_Timeline_HR1__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_Timeline_HR1__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_Timeline_HR3__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_Timeline_HR3__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_Timeline_HR2__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_Timeline_HR2__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_PlayVideo_Params
    {
    public:
        BB_ScoreboardVideos::EBB_ScoreboardVideos                    Video;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_EnterLogo_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_EnterCountdown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_ExitLogo_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_NextVideoSwap_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_ExitCountdown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_PlayStrikeoutTimeline_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_PlayHomerunIntroTimeline_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_PlayGrandSlamIntroTimeline_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_BeginCountdown_Params
    {
    public:
        int32_t                                                      Seconds;                                                 //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_ExecuteUbergraph_BB_Scoreboard_Large_BP_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0004[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_TimerDisplayReady__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_TimerCountdownComplete__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_MediaSequenceComplete__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Scoreboard_Large_BP_C_MediaComplete__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
