#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BB_Scoreboard_Large_Widget
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UBB_Scoreboard_Large_Widget_C_Construct_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UBB_Scoreboard_Large_Widget_C_UpdateBallLight1_Params
    {
    public:
        bool                                                         On;                                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UBB_Scoreboard_Large_Widget_C_UpdateBallLight2_Params
    {
    public:
        bool                                                         On;                                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UBB_Scoreboard_Large_Widget_C_UpdateBallLight3_Params
    {
    public:
        bool                                                         On;                                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UBB_Scoreboard_Large_Widget_C_UpdateOutLight1_Params
    {
    public:
        bool                                                         On;                                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UBB_Scoreboard_Large_Widget_C_UpdateOutLight2_Params
    {
    public:
        bool                                                         On;                                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UBB_Scoreboard_Large_Widget_C_UpdateOutLight3_Params
    {
    public:
        bool                                                         On;                                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UBB_Scoreboard_Large_Widget_C_UpdateBallLight4_Params
    {
    public:
        bool                                                         On;                                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UBB_Scoreboard_Large_Widget_C_UpdateStrike1_Params
    {
    public:
        bool                                                         On;                                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UBB_Scoreboard_Large_Widget_C_UpdateStrike2_Params
    {
    public:
        bool                                                         On;                                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UBB_Scoreboard_Large_Widget_C_UpdateStrike3_Params
    {
    public:
        bool                                                         On;                                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UBB_Scoreboard_Large_Widget_C_ExecuteUbergraph_BB_Scoreboard_Large_Widget_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
