#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::BB_Ball_Base { class ABB_Ball_Base_C; };
namespace CG::Engine { class AActor; };
namespace CG::SportsScramble { class AScramBall; };
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BB_Train_07_UnlimitedBatting
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_UpdateOptions_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_GetAllInstruments_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_GetAllBallClasses_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_GetRandomBallClass_Params
    {
    public:
        BB_Ball_Base::ABB_Ball_Base_C*                               RandomBallClass;                                         //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_BB_TRN_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_SpawnLauncherAndBarrier_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_ChangeBallClass_Params
    {
    public:
        BB_Ball_Base::ABB_Ball_Base_C*                               NewBallClass;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_LaunchTrainingBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_TrainingBallLaunched_Params
    {
    public:
        Engine::AActor*                                              Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_InitializeOutfieldTargets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_TargetHit_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      TargetId;                                                //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_InitializeInstrumentSelector_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_InstrumentSelected_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_StartTheLauncher_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_WhenTutorialBallHit_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_Unpaused_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_ResetOutfieldTargets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_CountDownCompleted_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_ShowCountdown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_07_UnlimitedBatting_C_ExecuteUbergraph_BB_Train_07_UnlimitedBatting_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
