#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_ENUMS.h"
#include "SportsScramble_ENUMS.h"
#include "CoreUObject_FVector.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BB_Train_05_BatBreaking
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_DespawnRunners_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_StopPlayingAudioComponents_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_SetUpInfoText_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_BB_TRN_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_ReadyForTraining_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_Tutorial_Step_01_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_Tutorial_Step_02_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_NotifyTrainingContinue_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_CalculateScore_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_CountDownCompleted_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_TrainingStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_AnnouncerExitSequenceComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_BatSwapped_Params
    {
    public:
        SportsScramble::EBaseballInstrumentType                      NewBat;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_ScorePlayer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_BindSportMgrEvents_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_HitCaught_Params
    {
    public:
        CoreUObject::FVector                                         BallLocation;                                            //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_HitFoul_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_HitSingle_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_HitDouble_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_HitTriple_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_HitHomeRun_Params
    {
    public:
        bool                                                         BasesLoaded;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_UnbindEvents_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_RunnersReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_OpenTravelCapsule_Params
    {
    public:
        float                                                        Delay;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_05_BatBreaking_C_ExecuteUbergraph_BB_Train_05_BatBreaking_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
