#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "SportsScramble_ENUMS.h"
#include "BB_ScoreboardVideos_ENUMS.h"
#include "UMG_ENUMS.h"
#include "CoreUObject_FVector.h"
#include "InputCore_FKey.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AActor; };
namespace CG::BB_BasketBall { class ABB_BasketBall_C; };
namespace CG::SportsScramble { class AScramBall; };
namespace CG::SportsScramble { class ABaseballBall; };
namespace CG::BB_Ball_Base { class ABB_Ball_Base_C; };
namespace CG::BB_Mitt { class ABB_Mitt_C; };
namespace CG::SportsScramble { class UScramEventBasePayload; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BB_Train_Base
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_AddActorToGameElementList_Params
    {
    public:
        Engine::AActor*                                              Actor;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Callback;                                                //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_Shutdown_Params
    {
    public:
        bool                                                         ShutdownBegun;                                           //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_SpawnPitchTargetListener_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_TNG_SpawnNeverMissBatter_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_TNG_TrackBasketballBounces_Params
    {
    public:
        BB_BasketBall::ABB_BasketBall_C*                             Basketball;                                              //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         DestroyBasketball;                                       //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_SpawnPitchingEquipment_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_SpawnBBScrambleDisplay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_SpawnLauncherBarrier_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_SpawnScrambleTargets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_GetBattingSide_Params
    {
    public:
        SportsScramble::EBattingSide                                 Side;                                                    //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_UpdateLargeScoreboardScore_Params
    {
    public:
        int32_t                                                      score;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Player2;                                                 //  0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_TeleportBatter_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_SpawnOutfieldTarget_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_SpawnWindows_Params
    {
    public:
        bool                                                         ShowTargetScore;                                         //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0003[0xF];                                   //  0x0001(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_SpawnBattingCage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_SpawnLauncher_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_SpawnPitchTarget_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_MakeStrikezoneVisible_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_UpdateTrainingScoreboardCount_Params
    {
    public:
        int32_t                                                      score;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_UpdateTrainingScoreboardScore_Params
    {
    public:
        int32_t                                                      score;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_CalculateEndScore_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_SpawnPitchingEquipment_DEPRECATED_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_ClearScoreboards_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_ShowScoreboardAnimation_Params
    {
    public:
        BB_ScoreboardVideos::EBB_ScoreboardVideos                    Animation;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_SetScoreMaterialAndFont_Params
    {
    public:
        int32_t                                                      FontSize;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_SetScoreVisibility_Params
    {
    public:
        UMG::ESlateVisibility                                        Visibility;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_AttachTrainingScoreboard_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BindToScoring_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_PlayerHitSingle_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_PlayerHitDouble_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_PlayerHitTriple_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_PlayerHitHomerun_Params
    {
    public:
        bool                                                         BasesLoaded;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_UnbindScoring_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_TrainingTargetHit_Params
    {
    public:
        SportsScramble::EBaseballScrambleTargetLocations             Location;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_OutfieldTargetHit_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      TargetId;                                                //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_BallLaunched_Params
    {
    public:
        Engine::AActor*                                              LaunchedBall;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_Strikezone_Strike_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_Strikezone_Ball_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_SportMgr_CatcherThrewBall_Params
    {
    public:
        SportsScramble::ABaseballBall*                               Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_SportMgr_PitcherReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_HitFloorCollision_Params
    {
    public:
        BB_Ball_Base::ABB_Ball_Base_C*                               Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        CoreUObject::FVector                                         HitLocation;                                             //  0x0008(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_CatcherCaughtBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_PitchTargetHit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_EndOfGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_PlayerMoved_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_NoTeleport_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_ReadyForTraining_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_EquipmentGrabbed_Params
    {
    public:
        Engine::AActor*                                              DominantHand;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BB_Mitt::ABB_Mitt_C*                                         Mitt;                                                    //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_PitcherCaughtSomething_Params
    {
    public:
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_BB_ResetScoreboards_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_LargeScoreboard_TrainingProgress_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_PitcherMittReleasedBall_Params
    {
    public:
        Engine::AActor*                                              TouchedActor;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        InputCore::FKey                                              ButtonReleased;                                          //  0x0008(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_OpenTravelCapsule_Params
    {
    public:
        float                                                        Delay;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_CloseTravelCapsule_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_Base_C_ExecuteUbergraph_BB_Train_Base_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0004[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
