#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_ENUMS.h"
#include "SportsScramble_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::SportsScramble { class ABaseballBall; };
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BB_Train_03_ScramblePitching
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_HasScrambleBallOption_Params
    {
    public:
        SportsScramble::ABaseballBall*                               Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         HasFrisbee;                                              //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_StopPlayingAudioComponents_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_SetupInfoText_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_BB_TRN_Balls_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_BaseballEvent_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_ResetGate_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_PitcherCaughtSomething_Params
    {
    public:
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_StartTimerHitFirstFrisbeeTarget_Params
    {
    public:
        float                                                        Time;                                                    //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_FrisbeeReminderVO_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_StartTimerGrabFrisbee_Params
    {
    public:
        float                                                        Time;                                                    //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_ReminderGrabFrisbee_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_StartTimerGrabImbuedFrisbee_Params
    {
    public:
        float                                                        Timer;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_ReminderGrabImbuedFrisbee_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_ReadyForTraining_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_Tutorial_Step_01_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_CalculateScore_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_CountDownCompleted_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_TrainingStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_CatcherCaughtBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_LookAtScrambleBalls_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_ScrambleSelectionShown_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_NotifyTrainingContinue_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_AnnouncerExitSequenceComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_Tutorial_Step_02_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_TrainingTargetHit_Params
    {
    public:
        SportsScramble::EBaseballScrambleTargetLocations             Location;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_Tutorial_Step_03_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_Tutorial_Step_04_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_ListenForNonImbuedFrisbeeGrabbed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_NonImbuedFrisbeeGrab_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_Tutorial_Step_05_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_ListenForImbuedFrisbeeGrabbed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_ImbuedFrisbeeGrabbed_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_ValidHit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_HandlePostTutorialTargetHits_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_GetNextPitchingTarget_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_DestroyAllInstruments_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_03_ScramblePitching_C_ExecuteUbergraph_BB_Train_03_ScramblePitching_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
