#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_ENUMS.h"
#include "CoreUObject_FVector.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };
namespace CG::Engine { class AActor; };
namespace CG::SportsScramble { class AScramBall; };
namespace CG::BB_Ball_Base { class ABB_Ball_Base_C; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BB_Train_04_BasicHitting
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_StopPlayingAudioComponents_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_SetupInfoText_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_BB_TRN_Hitting_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_ValidHitRegistered_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_BindValidHits_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_ProbablyAFoulBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_BindInvalidHits_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_ReadyForTraining_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_Tutorial_Step_01_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_Tutorial_Step_02_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_Tutorial_Step_03_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_InstrumentRelease_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_Tutorial_Step_04_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_Tutorial_Step_05_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_Tutorial_Step_06_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_NotifyTrainingContinue_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_FirstBallReady_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_BallLaunched_Params
    {
    public:
        Engine::AActor*                                              Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_BallHit_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_LaunchBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_Tutorial_Step_07_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_Tutorial_Step_08_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_CalculateScore_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_CountDownCompleted_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_TrainingStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_FirstTeeBallHit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_ActivateBattingTee_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_HitFloorCollision_Params
    {
    public:
        BB_Ball_Base::ABB_Ball_Base_C*                               Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        CoreUObject::FVector                                         HitLocation;                                             //  0x0008(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_AnnouncerExitSequenceComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_04_BasicHitting_C_ExecuteUbergraph_BB_Train_04_BasicHitting_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
