#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_ENUMS.h"
#include "CoreUObject_FVector.h"
#include "SportsScramble_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AActor; };
namespace CG::BB_Mitt { class ABB_Mitt_C; };
namespace CG::BB_Ball_Base { class ABB_Ball_Base_C; };
namespace CG::SportsScramble { class UScramEventBasePayload; };
namespace CG::CoreUObject { class UObject; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BB_Train_02_StrikezoneRegions
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_StopPlayingAudioComponents_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_SetupInfoText_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_BB_TRN_Regions_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_ReadyForTraining_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_Tutorial_Step_01_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_BB_EquipmentGrabbed_Params
    {
    public:
        Engine::AActor*                                              DominantHand;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BB_Mitt::ABB_Mitt_C*                                         Mitt;                                                    //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_Tutorial_Step_02_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_PlayerNeedsToTryAgain_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_CalculateScore_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_HitFloorCollision_Params
    {
    public:
        BB_Ball_Base::ABB_Ball_Base_C*                               Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        CoreUObject::FVector                                         HitLocation;                                             //  0x0008(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_CountDownCompleted_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_TrainingStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_NotifyTrainingContinue_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_AnnouncerExitSequenceComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_InpAxisEvt_StickDrivenGloveLeftRight_L_K2Node_InputAxisEvent_1_Params
    {
    public:
        float                                                        AxisValue;                                               //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_InpAxisEvt_StickDrivenGloveLeftRight_R_K2Node_InputAxisEvent_2_Params
    {
    public:
        float                                                        AxisValue;                                               //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_Tutorial_Step_03_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_PitcherCaughtSomething_Params
    {
    public:
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_TrainingTargetHit_Params
    {
    public:
        SportsScramble::EBaseballScrambleTargetLocations             Location;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_BaseballEvent_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_HandleInvalidPitch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_StartTimerMoveMitt_Params
    {
    public:
        float                                                        Time;                                                    //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_SliceInstructions_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_ListenForBallGrab_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_PlayerGrabbedBall_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_StopListeningForBallGrab_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_StartTimerBallGrabbed_Params
    {
    public:
        float                                                        Time;                                                    //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_ReminderVO_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_ListenForBBEvent_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_InpAxisEvt_StickDrivenGloveUpDown_L_K2Node_InputAxisEvent_3_Params
    {
    public:
        float                                                        AxisValue;                                               //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_InpAxisEvt_StickDrivenGloveUpDown_R_K2Node_InputAxisEvent_4_Params
    {
    public:
        float                                                        AxisValue;                                               //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABB_Train_02_StrikezoneRegions_C_ExecuteUbergraph_BB_Train_02_StrikezoneRegions_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
