#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::BowlingLane_Base { class ABowlingLane_Base_C; };
namespace CG::Engine { class USoundBase; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BowlingLaneManager
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_GetActiveLaneFromLaneManager_Params
    {
    public:
        BowlingLane_Base::ABowlingLane_Base_C*                       ActiveLane;                                              //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_Cleanup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_Timeline_Rotate__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_Timeline_Rotate__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_LaneManagerNewLane_Params
    {
    public:
        BowlingLane_Base::ABowlingLane_Base_C*                       NewLane;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        Engine::USoundBase*                                          AnnouncerVO;                                             //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_SpawnNewLane_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_LaneSetupComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_RotateLanes_Params
    {
    public:
        Engine::USoundBase*                                          AnnouncerVO;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_ExecuteUbergraph_BowlingLaneManager_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_LaneManagerReplacingLane__DelegateSignature_Params
    {
    public:
        BowlingLane_Base::ABowlingLane_Base_C*                       ReplacementLane;                                         //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BowlingLane_Base::ABowlingLane_Base_C*                       OutgoingLane;                                            //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLaneManager_C_LaneSwapComplete__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
