#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "CoreUObject_FTransform.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class USceneComponent; };
namespace CG::ScoreField { class AScoreField_C; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BowlingLane_CurvedPath
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_SpawnScoreFields_Params
    {
    public:
        int32_t                                                      ScoreAmount;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0xC];                                   //  0x0004(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FTransform                                      RelTransform;                                            //  0x0010(0x0030)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
        Engine::USceneComponent*                                     SceneComp;                                               //  0x0040(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        ScoreField::AScoreField_C*                                   ScoreFiel;                                               //  0x0048(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_ShutdownLane_Params
    {
    public:
        bool                                                         Callback;                                                //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_SetupLane_Params
    {
    public:
        bool                                                         Callback;                                                //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_BlindsInOut__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_BlindsInOut__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_BlindsUpDown__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_BlindsUpDown__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_BridgeUpDown__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_BridgeUpDown__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_BlindsOut_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_BlindsIn_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_BlindsDown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_BlindsUp_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_RaiseBridge_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_LowerBridge_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_DeactivateScoreFields_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_ActivateScoreFields_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingLane_CurvedPath_C_ExecuteUbergraph_BowlingLane_CurvedPath_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
