#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FName.h"
#include "BasicTypes_TArray.h"
#include "SportsScramble_ENUMS.h"
#include "SpecialBallType_ENUMS.h"
#include "BW_Quality_ENUMS.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::SportsScramble { class ABowlingBallReturn; };
namespace CG::BW_Ball_Base { class ABW_Ball_Base_C; };
namespace CG::BowlingLaneManager { class ABowlingLaneManager_C; };
namespace CG::BW_CenterScoreboard { class ABW_CenterScoreboard_C; };
namespace CG::SportsScramble { class ABowlingBall; };
namespace CG::Engine { class USoundBase; };
namespace CG::SportsScramble { class ABowlingLane; };
namespace CG::BowlingLane_Base { class ABowlingLane_Base_C; };
namespace CG::SportsScramble { class AScramBall; };
namespace CG::Engine { class AActor; };
namespace CG::SportsScramble { class AScramPrimitiveActor; };
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BowlingAlley_BP
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_GetBallReturn_Params
    {
    public:
        SportsScramble::ABowlingBallReturn*                          ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_GetOverrideLaneName_Params
    {
    public:
        BasicTypes::FName                                            LaneName;                                                //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            Name;                                                    //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_SetQueuedBalls_Params
    {
    public:
        BasicTypes::TArray<BW_Ball_Base::ABW_Ball_Base_C*>           QueuedBalls;                                             //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_QueueRandomBalls_Params
    {
    public:
        int32_t                                                      Num;                                                     //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<BW_Ball_Base::ABW_Ball_Base_C*>           Balls;                                                   //  0x0008(0x0010)  (Parm, OutParm, ZeroConstructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_GetLaneManagerFromAlley_Params
    {
    public:
        BowlingLaneManager::ABowlingLaneManager_C*                   BowlingLaneManager;                                      //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_GetCenterScoreboardFromAlley_Params
    {
    public:
        BW_CenterScoreboard::ABW_CenterScoreboard_C*                 CenterScoreboard;                                        //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_DebugDecrementLane_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_GetScore_Params
    {
    public:
        int32_t                                                      ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_SendBowlingEvent_Params
    {
    public:
        SportsScramble::EBowlingEvent                                BowlingEvent;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        SportsScramble::ABowlingBall*                                Ball;                                                    //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_SetLaneList_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FName>                        LaneList;                                                //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        bool                                                         ResetToAll;                                              //  0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_UpdateFrameBallCounter_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_SpawnSpecialBall_Params
    {
    public:
        SpecialBallType::ESpecialBallType                            NewParam;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0003[0xF];                                   //  0x0001(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_IsLocallyControlled_Params
    {
    public:
        bool                                                         LocallyControlled;                                       //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0004[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ProcessAudienceSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_CycleThroughLanes_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_IsLaneReady_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0005[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ResetScore_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_DebugIncrementLane_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_NewLaneCheck_Params
    {
    public:
        bool                                                         LaneChangeIncoming;                                      //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_GetRandomBall_Params
    {
    public:
        BW_Ball_Base::ABW_Ball_Base_C*                               BallClass;                                               //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        Engine::USoundBase*                                          AnnoucnerVO;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ProcessScore_Params
    {
    public:
        int32_t                                                      PinsDown;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0006[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        SportsScramble::ABowlingBall*                                BowlingBall;                                             //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_UpdateScoreBoard_Params
    {
    public:
        int32_t                                                      AddedPoints;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_GetActiveLane_Params
    {
    public:
        SportsScramble::ABowlingLane*                                ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_GetRandomLane_Params
    {
    public:
        BW_Quality::EBW_Quality                                      LaneQuality;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0007[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BowlingLane_Base::ABowlingLane_Base_C*                       LaneClass;                                               //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        Engine::USoundBase*                                          AnnouncerVO;                                             //  0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_Cleanup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_Timeline_ShowStrike__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_Timeline_ShowStrike__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_Timeline_ShowSpare__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_Timeline_ShowSpare__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_Timeline_LargeTrainScore__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_Timeline_LargeTrainScore__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_Timeline_SmallTrainScore__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_Timeline_SmallTrainScore__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_BindDebugBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_CreateDebugButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_DebugButtonsSelected_Params
    {
    public:
        int32_t                                                      ButtonSelected;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_DebugBallChanged_Params
    {
    public:
        SportsScramble::AScramBall*                                  NewBallClass;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_NetCreateDebugButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_NetDisplayStrike_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_NetDisplaySpare_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_RedrawScoreBoard_Params
    {
    public:
        int32_t                                                      NewScore;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_NetRedrawTrainingScoreboard_Params
    {
    public:
        int32_t                                                      NewScore;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_NetTrainingScoreFontSize_Params
    {
    public:
        int32_t                                                      NewFontSize;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ClearTrainingScoreboard_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ServerRedrawTrainingScoreboard_Params
    {
    public:
        int32_t                                                      NewScore;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ServerUpdateScoreBoard_Params
    {
    public:
        int32_t                                                      AddedPoints;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_NetUpdateScoreBoard_Params
    {
    public:
        int32_t                                                      AddedPoints;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ServerDisplayStrike_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ServerDisplaySpare_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_PrepRevealTrainingScoreboard_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_RevealTrainingScoreboard_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_BallRollComplete_Params
    {
    public:
        SportsScramble::ABowlingBall*                                Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Scoring;                                                 //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Out;                                                     //  0x0009(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         restricted;                                              //  0x000A(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_OnBallOut_Params
    {
    public:
        SportsScramble::ABowlingBall*                                Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         pit;                                                     //  0x0008(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         restricted;                                              //  0x0009(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_LaneSwap_Params
    {
    public:
        BowlingLane_Base::ABowlingLane_Base_C*                       NewLaneClass;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        Engine::USoundBase*                                          AnnouncerVO;                                             //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_WaitForPinResetComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_LaneSwapComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_PindeckHidden_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_StandardBallCreated_Params
    {
    public:
        BW_Ball_Base::ABW_Ball_Base_C*                               NewBall;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_EnableAlley_Params
    {
    public:
        bool                                                         EnableDebug;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         DisableLaneChanges;                                      //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Traditional;                                             //  0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_DisableAlley_Params
    {
    public:
        bool                                                         ResetLane;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_AdditionalAddedScore_Params
    {
    public:
        Engine::AActor*                                              Instigator;                                              //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      AddedScore;                                              //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_FinishLaneReset_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_SpawnSpecificBalls_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ScrambleBallCreated_Params
    {
    public:
        BW_Ball_Base::ABW_Ball_Base_C*                               NewBall;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_SpawnStandardBalls_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_BallFinishedLane_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ClearBall_Params
    {
    public:
        SportsScramble::ABowlingBall*                                Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_NetPlayerAnnouncerVO_Params
    {
    public:
        float                                                        Delay;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0008[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::USoundBase*                                          AnnouncerVO;                                             //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ResetAnnouncerVO_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_StandardBallDestroyed_Params
    {
    public:
        SportsScramble::AScramPrimitiveActor*                        DestroyedPrimitive;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ScrambleBallDestroyed_Params
    {
    public:
        SportsScramble::AScramPrimitiveActor*                        DestroyedPrimitive;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_InstigatorBallDestroyed_Params
    {
    public:
        SportsScramble::AScramPrimitiveActor*                        DestroyedPrimitive;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_AddInstigatorBall_Params
    {
    public:
        SportsScramble::ABowlingBall*                                InstigatorBall;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_NotifyGameEnding_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_SpawnRandomBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_BeginTraditionalFrame_Params
    {
    public:
        bool                                                         Solo;                                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_EndTraditionalFrame_Params
    {
    public:
        bool                                                         Solo;                                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         LastFrame;                                               //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ResetLane_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ServerPlayer1BallThrown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ServerPlayer2BallThrown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ServerCycleThroughLanes_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ServerResetPins_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ServerPlayerBallCountReset_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ServerSpawnSpecialBall_Params
    {
    public:
        SpecialBallType::ESpecialBallType                            NewParam;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ServerProcessPinsDown_Params
    {
    public:
        int32_t                                                      Pins;                                                    //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_SlideBallReturn_Params
    {
    public:
        bool                                                         slideForward;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_Multi_ResetFrameCounts_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_Server_SpawnSpecificBall_Params
    {
    public:
        BW_Ball_Base::ABW_Ball_Base_C*                               BallClass;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_PlayerAnnouncerVO_Params
    {
    public:
        float                                                        Delay;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0009[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::USoundBase*                                          AnnouncerVO;                                             //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_AddInstigatorBallCode_Params
    {
    public:
        SportsScramble::ABowlingBall*                                Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_NetSetLaneList_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FName>                        LaneList;                                                //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        bool                                                         ResetToAll;                                              //  0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_MoveBallReturn_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ExecuteUbergraph_BowlingAlley_BP_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_ProcessPinsDown__DelegateSignature_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Pins;                                                    //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_LaneReady__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_SpecialScoring__DelegateSignature_Params
    {
    public:
        int32_t                                                      LaneID;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      SpecialPoints;                                           //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_CurrentLaneScore__DelegateSignature_Params
    {
    public:
        int32_t                                                      LaneID;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      CurrentScore;                                            //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABowlingAlley_BP_C_BowlingEvent__DelegateSignature_Params
    {
    public:
        int32_t                                                      PlayerId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::EBowlingEvent                                BowlingEvent;                                            //  0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
