#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FName.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::SportsScramble { class ATrophyAwardListenerBase; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BP_TrophyGrabbable
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_PlayHaptic_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_GetTrophyAwardListener_Params
    {
    public:
        SportsScramble::ATrophyAwardListenerBase*                    trophyaward;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_InitializeCubbieMaterial_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_InitColor_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_InitializeWidget_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_SpawnTrophyProp_Params
    {
    public:
        bool                                                         wasCreated;                                              //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0xF];                                   //  0x0001(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_SpawnHighlighters_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_SetTrophyInstanceVisibility_Params
    {
    public:
        bool                                                         instanceVisible;                                         //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_GetIntegerRowInDataTable_Params
    {
    public:
        BasicTypes::FName                                            Name;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Order;                                                   //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_DoRespawn_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_CheckTrophyEarned_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_HideDisplay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_ShowInfoOnDisplay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_SetHighlight_Params
    {
    public:
        bool                                                         lightOn;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_InitializeDataTable_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_Timeline_0_0__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_Timeline_0_0__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_OnStopPointingAt_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_OnStartPointingAt_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_OnTrophyRespawnToOriginalPosition_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_SetVisibility_Params
    {
    public:
        bool                                                         visible;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_OnTrophyGrabbed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_OnTrophyReleased_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_Play_SFX_Highlight_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_Init_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_Play_Grab_SFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_DestroyTrophy_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyGrabbable_C_ExecuteUbergraph_BP_TrophyGrabbable_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
