#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_ENUMS.h"
#include "CoreUObject_FVector.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };
namespace CG::SportsScramble { class AScramPlayer; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BP_TrophyAward_BaseballBase
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_DidLocalPlayerWinGame_Params
    {
    public:
        bool                                                         won;                                                     //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_NewFunction_1_1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_CheckBBPlayer_Params
    {
    public:
        bool                                                         IsPlayerBatting;                                         //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         isThisPlayer;                                            //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_CheckPlayer_Params
    {
    public:
        int32_t                                                      PlayerIndex;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         IsLocalPlayer;                                           //  0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_GetLocalPlayer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_DebugEarn_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_Baseball_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_Strike_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      PlayerId;                                                //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_HomeRun_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      PlayerId;                                                //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_RunnerHome_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      PlayerId;                                                //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_AirCatchEvent_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_TakeBase_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_SwingAndMiss_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_Freebee_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_CatchEvent_Params
    {
    public:
        CoreUObject::FVector                                         FielderPosition;                                         //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_GameEnd_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      PlayerId;                                                //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_PitchEvent_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_WalkEvent_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_BadPitch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_BallEvent_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_OnHit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_TrophyAward_BaseballBase_C_ExecuteUbergraph_BP_TrophyAward_BaseballBase_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
