#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "UI_ButtonData_FUI_ButtonData.h"
#include "Engine_FHitResult.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::ScramPlayerHand_BP { class AScramPlayerHand_BP_C; };
namespace CG::Engine { class UPrimitiveComponent; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Button_Standard
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_ReleaseTouchExclusive_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_CheckMultitouch_Params
    {
    public:
        bool                                                         DisallowTouch;                                           //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_RotateHex_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_PlayHaptics_Params
    {
    public:
        ScramPlayerHand_BP::AScramPlayerHand_BP_C*                   Target;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        float                                                        HapticsScale;                                            //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_DisplayNoninteractable_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_DisplayInteractable_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_InstantToggle_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_SetButtonStatus_Params
    {
    public:
        bool                                                         DisableTouch;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_ChangeLook_Params
    {
    public:
        UI_ButtonData::FUI_ButtonData                                ButtonData;                                              //  0x0000(0x0020)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_Scale__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_Scale__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_ButtonMove__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_ButtonMove__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_Rotate__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_Rotate__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_Fill__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_Fill__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_SpinScale__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_SpinScale__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_Unlock__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_Unlock__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_BackgroundThrob__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Timeline_BackgroundThrob__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_BndEvt__ButtonCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 OverlappedComponent;                                     //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        Engine::AActor*                                              OtherActor;                                              //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        Engine::UPrimitiveComponent*                                 OtherComp;                                               //  0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      OtherBodyIndex;                                          //  0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         bFromSweep;                                              //  0x001C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::FHitResult                                           SweepResult;                                             //  0x0020(0x0088)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_BndEvt__ButtonCollision_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 OverlappedComponent;                                     //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        Engine::AActor*                                              OtherActor;                                              //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        Engine::UPrimitiveComponent*                                 OtherComp;                                               //  0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      OtherBodyIndex;                                          //  0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_FillStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_FillStop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_ScaleUp_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_ScaleDown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_PushButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_ReleaseButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_StartSwap_Params
    {
    public:
        bool                                                         CallEvents;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_StartRotate_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_DestroyButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_SpinScaleUp_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_SpinScaleDown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_PlayUnlock_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_PlayUnlockScal_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_StartThrob_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_StopThrob_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_ExternalActivateButton_Params
    {
    public:
        Engine::AActor*                                              HandActor;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_ExternalDeactivateButton_Params
    {
    public:
        Engine::AActor*                                              HandActor;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_BndEvt__ScramBoxInteractable_K2Node_ComponentBoundEvent_1_InteractableSignature__DelegateSignature_Params
    {
    public:
        Engine::AActor*                                              pInteractor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_BndEvt__ScramBoxInteractable_K2Node_ComponentBoundEvent_2_InteractableSignature__DelegateSignature_Params
    {
    public:
        Engine::AActor*                                              pInteractor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_BndEvt__ScramBoxInteractable_K2Node_ComponentBoundEvent_3_InteractableSignature__DelegateSignature_Params
    {
    public:
        Engine::AActor*                                              pInteractor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_BndEvt__ScramBoxInteractable_K2Node_ComponentBoundEvent_4_InteractableSignature__DelegateSignature_Params
    {
    public:
        Engine::AActor*                                              pInteractor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_DoHaptic_Params
    {
    public:
        Engine::AActor*                                              Hand;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        float                                                        Scale;                                                   //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_SendStartPointingAtMessage_Params
    {
    public:
        Engine::AActor*                                              interactor;                                              //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_TrySetHand_Params
    {
    public:
        Engine::AActor*                                              HandActor;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_ExecuteUbergraph_Button_Standard_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Untouched__DelegateSignature_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_Touched__DelegateSignature_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_SwapFinished__DelegateSignature_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_ShrinkFinish__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AButton_Standard_C_ButtonPressed__DelegateSignature_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
