#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "SportsScramble_ENUMS.h"
#include "Engine_ENUMS.h"
#include "SportsScramble_FBowlingThrow.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };
namespace CG::SportsScramble { class ABowlingPin; };
namespace CG::SportsScramble { class ABowlingLane; };
namespace CG::SportsScramble { class ABowlingFootballBlocker; };
namespace CG::BW_Ball_Base { class ABW_Ball_Base_C; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BW_Ball_Base
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_RemoveBindings_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_SetBindings_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_StopAllShotTypeFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_StopChargedSliceFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_PlayChargedSliceFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_StopSliceFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_PlaySliceFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_StopChargedFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_PlayChargedFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_StopImbuedFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_PlayImbuedFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_PlayDespawnFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_PlaySpawnFX_Params
    {
    public:
        bool                                                         SfxOnly;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0xF];                                   //  0x0001(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_SetTrail_Params
    {
    public:
        SportsScramble::EBowlingThrowType                            ThrowType;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_ClearTrail_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_BallGrabbed_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_OnThrowChanged_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_OnFloorResultChanged_Params
    {
    public:
        SportsScramble::EFloorResult                                 newFloorResult;                                          //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_DestroyPrimitive_Params
    {
    public:
        bool                                                         playOut;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        Delay;                                                   //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_ScaleBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_OnScaleUpFinished_Params
    {
    public:
        bool                                                         Forward;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_OnHitPin_Params
    {
    public:
        SportsScramble::ABowlingPin*                                 Pin;                                                     //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_OnHitLane_Params
    {
    public:
        SportsScramble::ABowlingLane*                                Lane;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        float                                                        bounceSpeed;                                             //  0x0008(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_OnHitFootballBlocker_Params
    {
    public:
        SportsScramble::ABowlingFootballBlocker*                     FootballBlocker;                                         //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_ExecuteUbergraph_BW_Ball_Base_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Ball_Base_C_ThrowChanged__DelegateSignature_Params
    {
    public:
        SportsScramble::FBowlingThrow                                ThrowStructure;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        uint8_t                                                      UnknownData_0003[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BW_Ball_Base::ABW_Ball_Base_C*                               Ball;                                                    //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
