#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_ENUMS.h"
#include "SportsScramble_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AActor; };
namespace CG::BowlingLane_Base { class ABowlingLane_Base_C; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BW_Challenge_06_SpeedBowling
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_UnbindEvents_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_IncrementCycleIndex_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_InitializeChallengeRoom_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_SetupInfoText_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_SpawnBalls_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_NotifyChallengeContinue_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_AnnouncerPresenting_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_BW_TriggerCountdown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_GameEnd_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_Shortcut_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_UpdateCurrentScore_Params
    {
    public:
        int32_t                                                      LaneID;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      CurrentScore;                                            //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_CustomTimer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_StartTraining_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_ChangeLane_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_LaneSwapping_Params
    {
    public:
        BowlingLane_Base::ABowlingLane_Base_C*                       ReplacementLane;                                         //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BowlingLane_Base::ABowlingLane_Base_C*                       OutgoingLane;                                            //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_ReduceTime_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_AnnouncerExitSequenceComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_BowlingEvent_Params
    {
    public:
        int32_t                                                      Player;                                                  //  0x0000(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::EBowlingEvent                                BowlingEvent;                                            //  0x0004(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Challenge_06_SpeedBowling_C_ExecuteUbergraph_BW_Challenge_06_SpeedBowling_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
