#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BW_CenterScoreboard
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_GetBlurTranslationAndScale_Params
    {
    public:
        float                                                        CarX;                                                    //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        float                                                        Translation;                                             //  0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        float                                                        Scale;                                                   //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_GetCarPosition_Params
    {
    public:
        bool                                                         Red;                                                     //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        CarPosition;                                             //  0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_GetAbsoluteCarPosition_Params
    {
    public:
        float                                                        CarPosition;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_GetRelativeCarPosition_Params
    {
    public:
        bool                                                         Red;                                                     //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        RelativePosition;                                        //  0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_InitializeTraditionalActors_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_UpdateVideoScoreboardActor_Params
    {
    public:
        bool                                                         Traditional;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         ActorFound;                                              //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0002[0x6];                                   //  0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_GetTimeRemaining_Params
    {
    public:
        int32_t                                                      ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_InitializeRoadActors_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_StartRoad__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_StartRoad__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_BlueCarDriftTimeline__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_BlueCarDriftTimeline__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_RedCarDriftTimeline__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_RedCarDriftTimeline__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_AnimateFinishLine__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_AnimateFinishLine__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_AnimateStartingLine__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_AnimateStartingLine__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_BlueCarDriveAway__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_BlueCarDriveAway__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_RedCarDriveAway__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_RedCarDriveAway__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_AnimateBlueCarY__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_AnimateBlueCarY__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_AnimateRedCarY__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_AnimateRedCarY__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_ScaleStartingLine__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_ScaleStartingLine__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_SpawnAnimBlueCar__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_SpawnAnimBlueCar__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_SpawnAnimRedCar__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_SpawnAnimRedCar__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_Timeline_TestingFinishLine__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_Timeline_TestingFinishLine__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_BW_StartTimer_Params
    {
    public:
        int32_t                                                      Count;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_TimerLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_ClearTimer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_PlayerBall1Thrown_Params
    {
    public:
        int32_t                                                      AlleyID;                                                 //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_PlayerBall2Thrown_Params
    {
    public:
        int32_t                                                      AlleyID;                                                 //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_PlayerBallCountReset_Params
    {
    public:
        int32_t                                                      AlleyID;                                                 //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_StartRaceTrack_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_StopMovingRoad_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_BlueCarDrift_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_RedCarDrift_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_ShowFinishLine_Params
    {
    public:
        bool                                                         TrainingTimer;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_HideFinishLine_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_ResetStartLine_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_BlueCarExit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_RedCarExit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_UpdateCarFromScore_Params
    {
    public:
        int32_t                                                      Player;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      NewScore;                                                //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_UpdateBlueCarPosition_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_UpdateRedCarPosition_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_CarsExitScoreboard_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_ResetBlueCar_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_ResetRedCar_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_ResetCars_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_StartRaceSounds_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_StopRaceLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_BW_StartTimerNoRace_Params
    {
    public:
        int32_t                                                      Value;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_BW_SetInitialTimer_Params
    {
    public:
        int32_t                                                      InitialTime;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         TrainingTimer;                                           //  0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_ShowTrainingFinishLine_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_HideTrainingFinishLine_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_UpdateMatchScore_Params
    {
    public:
        int32_t                                                      Player1GamesWon;                                         //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Player2GamesWon;                                         //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_TravelCapsuleOpening_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_ExecuteUbergraph_BW_CenterScoreboard_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_CenterScoreboard_C_TimerChange__DelegateSignature_Params
    {
    public:
        int32_t                                                      TimeLeft;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
