#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "SportsScramble_FMotionState.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };
namespace CG::SportsScramble { class AScramPrimitiveActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BW_Egg
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Egg_C_HasHatched_Params
    {
    public:
        bool                                                         Hatched;                                                 //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Egg_C_Local_Hatch_Params
    {
    public:
        SportsScramble::FMotionState                                 MotionState;                                             //  0x0000(0x0040)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Egg_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Egg_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Egg_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Egg_C_HatchCheck_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Egg_C_HatchFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Egg_C_HideEgg_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Egg_C_TurkeyDestroyed_Params
    {
    public:
        SportsScramble::AScramPrimitiveActor*                        PrimitveActor;                                           //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Egg_C_SM_Hatch_Params
    {
    public:
        SportsScramble::FMotionState                                 MotionState;                                             //  0x0000(0x0040)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Egg_C_Multi_Hatch_Params
    {
    public:
        SportsScramble::FMotionState                                 MotionState;                                             //  0x0000(0x0040)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Egg_C_ExecuteUbergraph_BW_Egg_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
