#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "SportsScramble_ENUMS.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::BW_Ball_Base { class ABW_Ball_Base_C; };
namespace CG::SportsScramble { class AScramPrimitiveActor; };
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BW_Train_05_BonusBalls
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_GetDelayPerBall_Params
    {
    public:
        BW_Ball_Base::ABW_Ball_Base_C*                               NewParam;                                                //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        float                                                        Delay;                                                   //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_TryAdvanceSingleBallProgression_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_GetShouldRespawn_Params
    {
    public:
        bool                                                         Reset;                                                   //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_TryResetSingleBallProgression_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_StopAudioComponents_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_ProgressTutorialEnum_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_InitializeTrainingRoom04_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_SpawnABall_Params
    {
    public:
        BW_Ball_Base::ABW_Ball_Base_C*                               BallClass;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_RespawnLastBall_Params
    {
    public:
        bool                                                         PlaySound;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_SpawnedBallDied_Params
    {
    public:
        SportsScramble::AScramPrimitiveActor*                        DestroyedPrimitive;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_SpawnedBallGrabbed_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_TutorialStepOne_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_TutorialStepTwo_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_TutorialStepThree_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_TutorialStepFour_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_CountDownCompleted_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_StartTraining_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_SpawnBalls_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_GetCurrentLaneScore_Params
    {
    public:
        int32_t                                                      LaneID;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      CurrentScore;                                            //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_ListenForBowlingEvent_Params
    {
    public:
        int32_t                                                      PlayerId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::EBowlingEvent                                BowlingEvent;                                            //  0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_RemindPlayerToGrabBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_NotifyTrainingContinue_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_AnnouncerExitSequenceComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_05_BonusBalls_C_ExecuteUbergraph_BW_Train_05_BonusBalls_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
