#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "SportsScramble_ENUMS.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::BW_Ball_Base { class ABW_Ball_Base_C; };
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };
namespace CG::SportsScramble { class AScramPrimitiveActor; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BW_Train_01_BasicBowling_Casual
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_InitializeTrainingRoom01_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_TutorialStepOne_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_TutorialStepTwo_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_SpecificBallCreated_Params
    {
    public:
        BW_Ball_Base::ABW_Ball_Base_C*                               Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_Tutorial_BW_BallGrabbed_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_TutorialStepThree_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_TutorialStepFour_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_TutorialStepFive_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_RetryPracticeRoll_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_CountDownCompleted_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_StartTraining_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_SpawnBalls_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_GetCurrentLaneScore_Params
    {
    public:
        int32_t                                                      LaneID;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      CurrentScore;                                            //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_ListenForBowlingEvent_Params
    {
    public:
        int32_t                                                      PlayerId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::EBowlingEvent                                BowlingEvent;                                            //  0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_CheckTutorialStatus_Params
    {
    public:
        SportsScramble::AScramPrimitiveActor*                        DestroyedPrimitive;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_NotifyTrainingContinue_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_AnnouncerExitSequenceComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABW_Train_01_BasicBowling_Casual_C_ExecuteUbergraph_BW_Train_01_BasicBowling_Casual_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
