#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FString.h"
#include "BasicTypes_FText.h"
#include "SportsScramble_ENUMS.h"
#include "Engine_ENUMS.h"
#include "GameResult_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::SportsScramble { class AScramBall; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Challenge_ScramSportManager_TN
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_TN_SportMgr_UnbindEvents_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_SpawnChallengeLocalHelper_Params
    {
    public:
        bool                                                         UseScoreboard;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_BindExistingServeLocationIndicator_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_OnRep_ServeLocationIndicator_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_BindNewServeLocationIndicator_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_ShowDebugInfo_Params
    {
    public:
        BasicTypes::FString                                          String;                                                  //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_CreateServeLocation_Params
    {
    public:
        bool                                                         Player1Serve;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_AllowAIServe_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_CreateReceiveLocation_Params
    {
    public:
        bool                                                         Player1Serve;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0002[0xF];                                   //  0x0001(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_GetGameStatus_Params
    {
    public:
        BasicTypes::FText                                            StatusText;                                              //  0x0000(0x0018)  (Parm, OutParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_GetPointType_Params
    {
    public:
        BasicTypes::FText                                            PointType;                                               //  0x0000(0x0018)  (Parm, OutParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_ResetResultBools_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_Cleanup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_TennisEvent_Params
    {
    public:
        int32_t                                                      Player;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::ETennisEvent                                 TennisEvent;                                             //  0x0004(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_PointMade_Params
    {
    public:
        int32_t                                                      P1Score;                                                 //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      P2Score;                                                 //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_LET_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_WaitForOpponentServe_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_InPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_Fault_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_PrePareServe_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_BallGrabbed_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_BallSpawned_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_SendDebugString_Params
    {
    public:
        BasicTypes::FString                                          S;                                                       //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_CreateDebugButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_ToggleDebug_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_PlayDoubleFaultSFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_MC_DisplayPointResults_Params
    {
    public:
        BasicTypes::FText                                            PointType;                                               //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        int32_t                                                      P1Score;                                                 //  0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      P2Score;                                                 //  0x001C(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Player1Winner;                                           //  0x0020(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         TextOnly;                                                //  0x0021(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_MC_MatchComplete_Params
    {
    public:
        bool                                                         OC5Demo;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0003[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      P1GamesWon;                                              //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      P2GamesWon;                                              //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_MC_GameComplete_Params
    {
    public:
        int32_t                                                      GameCount;                                               //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      P1GamesWon;                                              //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      P2GamesWon;                                              //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Player1Serve;                                            //  0x000C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_MC_ShowPreServeInfo_Params
    {
    public:
        BasicTypes::FText                                            GameStatusText;                                          //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        bool                                                         Player1Serve;                                            //  0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_MC_CreateStandLocations_Params
    {
    public:
        bool                                                         Player1Serve;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_ExecuteUbergraph_Challenge_ScramSportManager_TN_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_FaultServeResult__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_LetServeResult__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_PreServeStart__DelegateSignature_Params
    {
    public:
        int32_t                                                      Game;                                                    //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Point;                                                   //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Player1Serve;                                            //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_BallInPlay__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_PointComplete__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_ServeReady__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_GameComplete__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AChallenge_ScramSportManager_TN_C_MatchComplete__DelegateSignature_Params
    {
    public:
        GameResult::EGameResult                                      Result;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
