#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FText.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Countdown
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_Timeline_ScaleUp__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_Timeline_ScaleUp__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_StartCountdown_Params
    {
    public:
        int32_t                                                      Count;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_DisplayGameOver_Params
    {
    public:
        float                                                        Duration;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         DestroyActor;                                            //  0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_CountdownLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_ScaleUp_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_ScaleDown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_DisplayText_Params
    {
    public:
        float                                                        Duration;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         DestroyActor;                                            //  0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FText                                            Text;                                                    //  0x0008(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_CustomCountdown_Bowling_Params
    {
    public:
        bool                                                         DisplayBowl;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_ExecuteUbergraph_Countdown_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_BowlDisplayed__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_OneDisplayed__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_TwoDisplayed__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_ThreeDisplayed__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_GoMessage__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACountdown_C_CountdownComplete__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
