#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "SportsScramble_ENUMS.h"
#include "BasicTypes_FName.h"
#include "BasicTypes_TArray.h"
#include "SportsScramble_FScramFriend.h"
#include "SportsScramble_FScramGameInvite.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::DebugMainMenu
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_DestroyDebugMainMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_DestroyGameActors_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_BindTestActor_Params
    {
    public:
        Engine::AActor*                                              Actor;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CreateGameSelector_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_LoadHub_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_GlobalCleanup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_Timeline_ScaleDebutMenu__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_Timeline_ScaleDebutMenu__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnFailure_FE43AE584DB619A31AB355837624ACB1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnSuccess_FE43AE584DB619A31AB355837624ACB1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnFailure_CB7A18C444F2E804805EC3A034E45049_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnSuccess_CB7A18C444F2E804805EC3A034E45049_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnCancel_E743FFE14EFCF26E822A9C9F86551D97_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnTimeout_E743FFE14EFCF26E822A9C9F86551D97_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnFailure_E743FFE14EFCF26E822A9C9F86551D97_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnSuccessClient_E743FFE14EFCF26E822A9C9F86551D97_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnSuccessHost_E743FFE14EFCF26E822A9C9F86551D97_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnFailure_F616CB334D1CC99D841975AF7AC92006_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnSuccess_F616CB334D1CC99D841975AF7AC92006_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnFailure_3315261D4C69B45B41D5C69D9651E093_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnSuccess_3315261D4C69B45B41D5C69D9651E093_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnFailure_967B8F434732D5BD94D7A48E995A66A5_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnSuccess_967B8F434732D5BD94D7A48E995A66A5_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_ReturnToHub_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_LoadHubReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_GameSelected_Params
    {
    public:
        int32_t                                                      ButtonSelected;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_SpawnDebugTopMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_MultiplayerCanceled_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_StartTennis_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_SpawnTestsMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_TestChoiceMade_Params
    {
    public:
        int32_t                                                      ButtonSelected;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_TestOver_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_TeleportToVenue_Params
    {
    public:
        SportsScramble::EScramSport                                  Sport;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         TrainingLevel;                                           //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x6];                                   //  0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FName                                            LevelOverride;                                           //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_LoadGameplayLevel_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_RemoveTravelTunnel_Params
    {
    public:
        BasicTypes::FName                                            NewGeoLevel;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomLevelLoaded_Params
    {
    public:
        BasicTypes::FName                                            NewPrimaryLevel;                                         //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_HubLoaded_Params
    {
    public:
        BasicTypes::FName                                            NewPrimaryLevel;                                         //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_SpawnGameSelector_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_MatchmakingChoiceMade_Params
    {
    public:
        int32_t                                                      ButtonSelected;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_SpawnMatchmakingCancelMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_SpawnMatchmakingPrefsMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_PrefsChoiceMade_Params
    {
    public:
        int32_t                                                      ButtonSelected;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_OnGetFriends_Params
    {
    public:
        bool                                                         wasSuccessful;                                           //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<SportsScramble::FScramFriend>             friends;                                                 //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_InviteAccepted_Params
    {
    public:
        int32_t                                                      ButtonSelected;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_InviteFriend_Params
    {
    public:
        int32_t                                                      ButtonSelected;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CancelInviteFriend_Params
    {
    public:
        int32_t                                                      ButtonSelected;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_RefreshComplete_Params
    {
    public:
        bool                                                         wasSuccessful;                                           //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0002[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<SportsScramble::FScramGameInvite>         invites;                                                 //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_DoneWithAvatarMenu_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_1_Params
    {
    public:
        bool                                                         AllAwardsComplete;                                       //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_2_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_ScaleUpMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_ScaleDownMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_3_Params
    {
    public:
        bool                                                         AllAwardsComplete;                                       //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_4_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_6_Params
    {
    public:
        bool                                                         AllAwardsComplete;                                       //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_7_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_9_Params
    {
    public:
        bool                                                         AllAwardsComplete;                                       //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_10_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_11_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_5_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_8_Params
    {
    public:
        bool                                                         WideNextButton;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_12_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_13_Params
    {
    public:
        bool                                                         WideNextButton;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_14_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_15_Params
    {
    public:
        bool                                                         WideNextButton;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_16_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_17_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_18_Params
    {
    public:
        bool                                                         WideNextButton;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_CustomEvent_19_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_ExecuteUbergraph_DebugMainMenu_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0003[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_LevelReady__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_DebugTopMenuDeactivated__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_DebugTopMenuActive__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADebugMainMenu_C_ShowMainMenu__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
