#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "CoreUObject_FTransform.h"
#include "UI_ButtonData_FUI_ButtonData.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Button_Standard { class AButton_Standard_C; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::DemoMainMenu
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_ShowMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_HideMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_BindPause_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_RemoveButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_DisableButtonInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_SpawnButton_Params
    {
    public:
        CoreUObject::FTransform                                      SpawnTransform;                                          //  0x0000(0x0030)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
        UI_ButtonData::FUI_ButtonData                                ButtonDataStart;                                         //  0x0030(0x0020)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
        UI_ButtonData::FUI_ButtonData                                ButtonDataToggled;                                       //  0x0050(0x0020)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0070(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0074(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Button_Standard::AButton_Standard_C*                         Button;                                                  //  0x0078(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_SelectionMade_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_CloseMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_ButtonSwapped_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_OpenMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_ButtonDestroyed_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_GamePaused_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_GameUnpaused_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_ButtonTouched_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_ButtonUntouched_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_ExecuteUbergraph_DemoMainMenu_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMainMenu_C_ChoiceMade__DelegateSignature_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
