#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FString.h"
#include "BasicTypes_FName.h"
#include "BasicTypes_FText.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::DemoStart
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_UpdateScoreboards_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_DebugMessage_Params
    {
    public:
        BasicTypes::FString                                          Message;                                                 //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_UpdateInstrumentHand_Params
    {
    public:
        bool                                                         Racket;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_FadeOutAllMusic_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ResetScoreboards_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_TrainingSetup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_AddNet_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_GetMultipleLocStrings_Params
    {
    public:
        BasicTypes::FName                                            Name1;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            Name2;                                                   //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            Name3;                                                   //  0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            Name4;                                                   //  0x0018(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            Name5;                                                   //  0x0020(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FText                                            Text1;                                                   //  0x0028(0x0018)  (Parm, OutParm)
        BasicTypes::FText                                            Text2;                                                   //  0x0040(0x0018)  (Parm, OutParm)
        BasicTypes::FText                                            Text3;                                                   //  0x0058(0x0018)  (Parm, OutParm)
        BasicTypes::FText                                            Text4;                                                   //  0x0070(0x0018)  (Parm, OutParm)
        BasicTypes::FText                                            Text5;                                                   //  0x0088(0x0018)  (Parm, OutParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ShowGeo_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ShowLogos_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_CreateHandednessMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_HandChoiceMade_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_RevealSequence_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_CreateMainMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_MainMenuSelectionMade_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_StartTraining_Params
    {
    public:
        BasicTypes::FName                                            NewGeoLevel;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_SendToTraining_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ReadyTeleportToTraining_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_LoadTrainingLevel_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ReturnFromTraining_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ReturnFromTrainingComplete_Params
    {
    public:
        BasicTypes::FName                                            NewGeoLevel;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_BeginQuickPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ReturnFromQP_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ReturnToMenuFromQP_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_QPDone_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_QuickPlayOver_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_BuyNow_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ShowBuyNow_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ReadyToHowBuyNow_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_StartMatchmaking_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ReadyForMatchMaking_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_BeginMatchMaking_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_StartOnlineMatch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ChooseHandComplete_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_MainMenuRemoved_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_LoadGeo_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_HiddenHubLoaded_Params
    {
    public:
        BasicTypes::FName                                            NewGeoLevel;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_GameplayLoaded_Params
    {
    public:
        BasicTypes::FName                                            NewPrimaryLevel;                                         //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_StartingHost_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ErrorMessageComplete_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_BuyChoiceMade_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_FadeUpMpMusic_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_FailedMp_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_BackToMainFromMatchMaking_Params
    {
    public:
        bool                                                         SpawnGeo;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoStart_C_ExecuteUbergraph_DemoStart_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
