#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FString.h"
#include "BasicTypes_FName.h"
#include "BasicTypes_TArray.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class APlayerController; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::DemoMatchMaking
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_EnableMenuInput_Params
    {
    public:
        bool                                                         InputEnabled;                                            //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_DisableMenuInput_Params
    {
    public:
        bool                                                         InputDisabled;                                           //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_RestoreSubMenu_Params
    {
    public:
        bool                                                         MenuShown;                                               //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_HideSubMenu_Params
    {
    public:
        bool                                                         MenuHidden;                                              //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_RemoveSubMenu_Params
    {
    public:
        bool                                                         Removed;                                                 //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_SwapToCheckingConnection_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_SwapToConnectionFailed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_SwapToClientFound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_SwapToWaitingForClient_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_SwapToRetry_Params
    {
    public:
        bool                                                         Instant;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_DisableButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_SpawnRetryButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_SpawnCancelButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_UpdateMenuVisiblilty_Params
    {
    public:
        bool                                                         visible;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_SpawnHeader_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_ClientPlayerReady_Params
    {
    public:
        bool                                                         ClientPlayerReady;                                       //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_DebugMessage_Params
    {
    public:
        BasicTypes::FString                                          Message;                                                 //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_MultiplayerInit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_UpdateBodyText_Params
    {
    public:
        BasicTypes::FName                                            LocText;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_Timeline_ScaleMenu__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_Timeline_ScaleMenu__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnFailure_FE43AE584DB619A31AB355839732FBA2_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnSuccess_FE43AE584DB619A31AB355839732FBA2_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnFailure_CB7A18C444F2E804805EC3A0D5F2075A_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnSuccess_CB7A18C444F2E804805EC3A0D5F2075A_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnFailure_173A560243B6DA541CA9DEBC94261E07_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnSuccess_173A560243B6DA541CA9DEBC94261E07_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnFailure_CB7A18C444F2E804805EC3A041231AE9_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnSuccess_CB7A18C444F2E804805EC3A041231AE9_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnFailure_A7F8E2534CF513D7C2BA09839338A46C_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnSuccess_A7F8E2534CF513D7C2BA09839338A46C_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnFailure_51B1F6A7431B0D2F366F418CA407AC99_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnSuccess_51B1F6A7431B0D2F366F418CA407AC99_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnFailure_FE43AE584DB619A31AB3558303E3E611_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnSuccess_FE43AE584DB619A31AB3558303E3E611_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnFailure_D001D9904DBF2ABF2E47D6BA76F65BB0_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OnSuccess_D001D9904DBF2ABF2E47D6BA76F65BB0_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_LookForHost_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_StartHosting_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_ClientJoined_Params
    {
    public:
        Engine::APlayerController*                                   NewPlayer;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         IsSpectator;                                             //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_ContinueWait_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_FirstMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_HeaderClosing_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_DestroyMenu_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_OpenMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_WaitForClientLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_CloseMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_RetrySelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_ButtonPressed_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_ExitSelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_RemoveMatchMaking_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_ClientFailToJoin_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_CheckOnlineSystem_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_CheckConnectionResult_Params
    {
    public:
        bool                                                         ConnectionOk;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_PlayerLeftBoundary_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_PlayerEnteredBoundary_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_CheckForClient_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_FadePreJoin_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FString>                      SessionsFound;                                           //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_WaitForTravel_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_HostFailed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_ExecuteUbergraph_DemoMatchMaking_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_FadeInMusic__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_FadeMusic__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_BackToMain__DelegateSignature_Params
    {
    public:
        bool                                                         SpawnGeo;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatchMaking_C_MatchStarting__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
