#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::DemoTraining_Results
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_EnableMenuInput_Params
    {
    public:
        bool                                                         InputEnabled;                                            //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_DisableMenuInput_Params
    {
    public:
        bool                                                         InputDisabled;                                           //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_RestoreSubMenu_Params
    {
    public:
        bool                                                         MenuShown;                                               //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_HideSubMenu_Params
    {
    public:
        bool                                                         MenuHidden;                                              //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_RemoveSubMenu_Params
    {
    public:
        bool                                                         Removed;                                                 //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_SpawnButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_DisableButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_RemoveButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_ScaleMenu__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_ScaleMenu__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_ScaleBox__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_ScaleBox__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_SwapBoxText__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_SwapBoxText__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_ShowHighScore__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_ShowHighScore__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_ShowMessage__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_ShowMessage__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_ScaleText__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_ScaleText__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_MoveInnerMessage__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_Timeline_MoveInnerMessage__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_SelectionMade_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_DisplayMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_MenuComplete_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_RemoveMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_ButtonPressed_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_RevealBox_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_ShowScore_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_ShowHighScore_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_RevealMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_MoveMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_ShowInnerMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_ExecuteUbergraph_DemoTraining_Results_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_ChoiceMadePreDestroy__DelegateSignature_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_AllButtonsDestroyed__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoTraining_Results_C_ChoiceMade__DelegateSignature_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
