#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "InputCore_FKey.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::DemoOptions
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_SetupConfirmation_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_KeepMenuInstrument_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_ShowInstrument_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_HideInstrument_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_ShowNoIcon_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_SwapMenu_Params
    {
    public:
        bool                                                         Confirmation;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_GetActivity_Params
    {
    public:
        Engine::AActor*                                              ActivityActor;                                           //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_InitButtonStates_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_UpdateRacketHand_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_UpdateBoundary_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_DisableAllButtons_Params
    {
    public:
        bool                                                         DisableTouch;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_MenuVisibility_Params
    {
    public:
        bool                                                         Visibility;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_Timeline_MenuScale__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_Timeline_MenuScale__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_OnFailure_CB7A18C444F2E804805EC3A092C12D92_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_OnSuccess_CB7A18C444F2E804805EC3A092C12D92_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_OnFailure_FE43AE584DB619A31AB35583D001D16A_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_OnSuccess_FE43AE584DB619A31AB35583D001D16A_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_InpActEvt_Pause_K2Node_InputActionEvent_1_Params
    {
    public:
        InputCore::FKey                                              Key;                                                     //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_HandSelectionMade_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_CloseMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_HandButtonSwapped_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_OpenMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_HeaderDestroyed_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_BackButtonPressed_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_BoundaryButtonSelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_VoiceChatSelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_ForfeitSelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_QuitMultiplayer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_SwapBackToMain_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_ForfeitConfirmed_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_ShowVoiceConfirmation_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_ExecuteUbergraph_DemoOptions_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoOptions_C_OptionsClosed__DelegateSignature_Params
    {
    public:
        bool                                                         ForceKeepTravelCapsule;                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         ReAllowPause;                                            //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
