#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_ENUMS.h"
#include "GameResult_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AController; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::DemoMatch
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_StopActivity_Params
    {
    public:
        bool                                                         KeepShell;                                               //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_UpdateScoreboards_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_DestroyOldMenu_Params
    {
    public:
        bool                                                         WaitForMenu;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_Cleanup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_GetLogoActors_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_ErrorDisplay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_EndStaging_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_SpectatorInit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_SpawnEndGameAnnouncer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_MultiplayerInit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_Timeline_Spectator1__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_Timeline_Spectator1__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_OnFailure_FE43AE584DB619A31AB3558375912B0E_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_OnSuccess_FE43AE584DB619A31AB3558375912B0E_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_OnFailure_CB7A18C444F2E804805EC3A03751D7F6_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_OnSuccess_CB7A18C444F2E804805EC3A03751D7F6_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_OnFailure_FE43AE584DB619A31AB3558343638AB8_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_OnSuccess_FE43AE584DB619A31AB3558343638AB8_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_OnFailure_CB7A18C444F2E804805EC3A001A37640_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_OnSuccess_CB7A18C444F2E804805EC3A001A37640_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_OnFailure_CB7A18C444F2E804805EC3A0AA407FC1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_OnSuccess_CB7A18C444F2E804805EC3A0AA407FC1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_OnFailure_FE43AE584DB619A31AB35583E8808339_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_OnSuccess_FE43AE584DB619A31AB35583E8808339_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_Spec_CycleCameras_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_SpectatorExit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_PrepSpectatorForExit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_NewServe_Params
    {
    public:
        int32_t                                                      Game;                                                    //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Point;                                                   //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Player1Serve;                                            //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_BeginReveal_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_TransitionComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_AnnouncerLine13_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_AnnouncerLine1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_AnnouncerExit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_RevealOpponent_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_ClosingAnnouncerComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_DoReveal_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_DoneRevealingOpponent_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_EndingAnnouncer_Params
    {
    public:
        bool                                                         HostWon;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_ResetDemo_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_RevealAnimationCompleted_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_EndAnnouncerReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_HostReadyTeleport_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_FadeComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_NameAnnounce_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_ClientDisconnected_Params
    {
    public:
        Engine::AController*                                         ExitingPlayer;                                           //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         IsSpectator;                                             //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_SinglePlayerStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_RevealComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_Reset_Params
    {
    public:
        GameResult::EGameResult                                      Result;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_QuitMatch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_MatchMakingDestroyed_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_ErrorMessageComplete_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_ErrorMessageFaded_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_ShowDiscoMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_AnnouncerLine2_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_AnnouncerLine3_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_StartShutdown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_StartMatch_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_PrepForTransition_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_ExecuteUbergraph_DemoMatch_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0xC];                                   //  0x0004(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ADemoMatch_C_SinglePlayerComplete__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
