#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FName.h"
#include "BasicTypes_UScriptDelegate.h"
#include "InputCore_FKey.h"
#include "HubMenuChoices_ENUMS.h"
#include "SportsScramble_ENUMS.h"
#include "MainMenuChoices_ENUMS.h"
#include "SelectionDetailsMenuType_ENUMS.h"
#include "GameModeTypes_ENUMS.h"
#include "SportsScramble_FScramGameInvite.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::GameHandlerBase { class AGameHandlerBase_C; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::FrontEndManager
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_PlayThemeMusic_Params
    {
    public:
        bool                                                         PlayIntro;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        FadeTime;                                                //  0x0004(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_SpawnMenuStand_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_TeleportPlayAreaToArena_Params
    {
    public:
        BasicTypes::FName                                            RowName;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         UseTransitionDuration;                                   //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        TransitionDuration;                                      //  0x000C(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_RemoveLogo_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_SpawnLogo_Params
    {
    public:
        bool                                                         LogoOnly;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_SpawnGame_Params
    {
    public:
        GameHandlerBase::AGameHandlerBase_C*                         GameplayHandler;                                         //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0003[0x8];                                   //  0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_SpawnTempMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_DemoStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_CheckDebugMode_Params
    {
    public:
        bool                                                         DebugActive;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0004[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_CheckDemoMode_Params
    {
    public:
        bool                                                         DemoActive;                                              //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0005[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_Timeline_RotateAnnouncer__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_Timeline_RotateAnnouncer__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_Timeline_ErrorMessageScale__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_Timeline_ErrorMessageScale__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_OnFailure_FE43AE584DB619A31AB35583454BD2A5_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_OnSuccess_FE43AE584DB619A31AB35583454BD2A5_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_OnFailure_CB7A18C444F2E804805EC3A0078B2E5D_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_OnSuccess_CB7A18C444F2E804805EC3A0078B2E5D_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_OnFailure_CB7A18C444F2E804805EC3A01E43AE2F_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_OnSuccess_CB7A18C444F2E804805EC3A01E43AE2F_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_InpActEvt_DebugButton_K2Node_InputActionEvent_2_Params
    {
    public:
        InputCore::FKey                                              Key;                                                     //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_OnFailure_FE43AE584DB619A31AB355835C8352D7_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_OnSuccess_FE43AE584DB619A31AB355835C8352D7_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_InpActEvt_Pause_K2Node_InputActionEvent_1_Params
    {
    public:
        InputCore::FKey                                              Key;                                                     //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_OnFailure_9E6C8D1F493095BCB7D1C4B4615CCC02_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_OnSuccess_9E6C8D1F493095BCB7D1C4B4615CCC02_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_BeginIntro_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_StartAnnouncerAudio_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_PrepareReveal_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_AnnouncerReveal_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_AnnouncerTransform_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_TransformComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_AnnouncerExitComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ShortIntroBegin_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_NuxIntroBegin_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_Hub01AnimComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_Hub02AnimComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_Hub03AnimComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_Hub04AnimComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ReturnAnnouncerToSpawn_Params
    {
    public:
        bool                                                         UseHubExit;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ShortIntroClipComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_RevealBeacon_Params
    {
    public:
        HubMenuChoices::EHubMenuChoices                              BeaconType;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_RotateAnnouncer_Params
    {
    public:
        HubMenuChoices::EHubMenuChoices                              Choice;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0006[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        Angle;                                                   //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_TeleportToVenue_Params
    {
    public:
        SportsScramble::EScramSport                                  Sport;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         TrainingLevel;                                           //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0007[0x6];                                   //  0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FName                                            LevelOverride;                                           //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_LoadGameplayLevel_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_RemoveTravelTunnel_Params
    {
    public:
        BasicTypes::FName                                            NewGeoLevel;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_CustomLevelLoaded_Params
    {
    public:
        BasicTypes::FName                                            NewPrimaryLevel;                                         //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_StartDemo_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ReadyToStartGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_GameHandlerTeleport_Params
    {
    public:
        SportsScramble::EScramSport                                  Sport;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         TrainingLevel;                                           //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0008[0x6];                                   //  0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FName                                            LevelOverride;                                           //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ResetGameplayLevel_Params
    {
    public:
        BasicTypes::FName                                            SpawnLocOverride;                                        //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_AllowSwap_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_CreateMainMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ShowLogoScreen_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ToggleDebugMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_DisallowSwap_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_CreateDebugMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_MainMenuSelectionMade_Params
    {
    public:
        MainMenuChoices::EMainMenuChoices                            Choice;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_SpawnHubMenu_Params
    {
    public:
        bool                                                         NUX;                                                     //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_HubMenuSelection_Params
    {
    public:
        HubMenuChoices::EHubMenuChoices                              Selection;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_CreateDetailsMenu_Params
    {
    public:
        SelectionDetailsMenuType::ESelectionDetailsMenuType          MenuType;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::EScramSport                                  Sport;                                                   //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        GameModeTypes::EGameModeTypes                                ResultsType;                                             //  0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_GameSelectionMade_Params
    {
    public:
        SportsScramble::EScramSport                                  Sport;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         SinglePlayer;                                            //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ReturnToHub_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ReadyToReturnToHub_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_PlayerHasReturnedToHub_Params
    {
    public:
        BasicTypes::FName                                            NewPrimaryLevel;                                         //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ReloadHub_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_HiddenHubLoaded_Params
    {
    public:
        BasicTypes::FName                                            NewPrimaryLevel;                                         //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_LevelChanged_Params
    {
    public:
        BasicTypes::FName                                            Level;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_SpawnResultsScreen_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_TrophyRoomLoaded_Params
    {
    public:
        BasicTypes::FName                                            NewPrimaryLevel;                                         //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_GoToTrophyRoom_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_TrophyRoomPositionConfirmed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ReadyToLoadTrophyRoom_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ExitTrophies_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_DebugResetTrophies_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_SetupDone_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_QuitGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ShowQuitConfirmation_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ReadyToShowConfirmation_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_QuitChoiceMade_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_PlayerReadyForIntro_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_PlayerFadedOut_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_OptionMenuPostionConfirmed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ReadyToSpawnOptionsMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ShowOptionsMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_OptionsMenuDestroyed_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_StandButtonPressed_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_StandSelectionMade_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_CloseMenuStnad_Params
    {
    public:
        HubMenuChoices::EHubMenuChoices                              Choice;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0009[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        Angle;                                                   //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_SpawnIntroOnlyConfettiCannonVFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_LevelsUnloaded_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_HubSelectionStarted_Params
    {
    public:
        HubMenuChoices::EHubMenuChoices                              Choice;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0010[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        Angle;                                                   //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_StartLoopingConfetti_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_StopLoopingConfetti_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ShellInviteFromRelaunchFailed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_OnShellInviteAccepted_Params
    {
    public:
        SportsScramble::FScramGameInvite                             GameInvite;                                              //  0x0000(0x0060)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ClientUnrealJoinFailed_Params
    {
    public:
        SportsScramble::EScramPendingGameFailure                     failureType;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ErrorMessageComplete_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ScaleUpErrorMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ScaleDownErrorMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_DisplayErrorMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_SpawnErrorMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ErrorButtonPressed_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_DisplayIntroMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_EndIntroMessage_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ContinueSetup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ContinueIntro_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AFrontEndManager_C_ExecuteUbergraph_FrontEndManager_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0011[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
