#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "GameResult_ENUMS.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::GameHandlerQuickplay
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_StartBaseball_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_SetupBaseball_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_StartBowling_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_SetupBowling_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_ShutDown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_StartTennis_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_SetupTennis_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_MatchComplete_Params
    {
    public:
        GameResult::EGameResult                                      Result;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_QuitGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_BaseballGameCompleted_Params
    {
    public:
        bool                                                         LocalPlayerVictory;                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      AwayScore;                                               //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      HomeScore;                                               //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_BowlingGameComplete_Params
    {
    public:
        GameResult::EGameResult                                      MatchResult;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      Player1GamesWon;                                         //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Player2GamesWon;                                         //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerQuickplay_C_ExecuteUbergraph_GameHandlerQuickplay_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
