#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "PnpGameType_ENUMS.h"
#include "BasicTypes_UScriptDelegate.h"
#include "BasicTypes_FName.h"
#include "UI_LeftArrowButtons_ENUMS.h"
#include "UI_RightArrowButtons_ENUMS.h"
#include "BasicTypes_FText.h"
#include "ResultsData_FResultsData.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Menu_PnpPreferences { class AMenu_PnpPreferences_C; };
namespace CG::Menu_ResultsScore { class AMenu_ResultsScore_C; };
namespace CG::Menu_EnterName { class AMenu_EnterName_C; };
namespace CG::Menu_PnpReadyPlayer { class AMenu_PnpReadyPlayer_C; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::GameHandlerPnp
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_CreateScoreListMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_CreatePnpPreferencesMenu_Params
    {
    public:
        PnpGameType::EPnpGameType                                    SetupType;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        Menu_PnpPreferences::AMenu_PnpPreferences_C*                 Menu;                                                    //  0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_PreferenceSetupNeeded_Params
    {
    public:
        PnpGameType::EPnpGameType                                    SetupNeeded;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_Cleanup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_SwapInstrumentHand_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_UpdatePlayerSettings_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ClearScores_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_CreateResultsScoreMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        Menu_ResultsScore::AMenu_ResultsScore_C*                     Menu;                                                    //  0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x8];                                   //  0x0018(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_SpawnMinigame_Params
    {
    public:
        BasicTypes::FName                                            Game;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_CreateEnterNameMenu_Params
    {
    public:
        Menu_EnterName::AMenu_EnterName_C*                           Menu;                                                    //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_NextMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_CreateReadyPlayerMenu_Params
    {
    public:
        bool                                                         PassToPlayer;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0002[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        Menu_PnpReadyPlayer::AMenu_PnpReadyPlayer_C*                 Menu;                                                    //  0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_PrepareNextRound_Params
    {
    public:
        bool                                                         NewRoundIncoming;                                        //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         GameOver;                                                //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0003[0x2];                                   //  0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      NextPlayer;                                              //  0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_UpdatePlayerPosition_Params
    {
    public:
        BasicTypes::FName                                            RowName;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_CheckProperLevel_Params
    {
    public:
        BasicTypes::FName                                            Game;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         LoadNeeded;                                              //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0004[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_InitializePnp_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_SpawnHeader_Params
    {
    public:
        bool                                                         Results;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_TypicalNavButtons_Params
    {
    public:
        UI_LeftArrowButtons::EUI_LeftArrowButtons                    LeftButton;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        UI_RightArrowButtons::EUI_RightArrowButtons                  RightButton;                                             //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         WideSpacing;                                             //  0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0005[0x5];                                   //  0x0003(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::UScriptDelegate                                  LeftEvent;                                               //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        BasicTypes::UScriptDelegate                                  RightEvent;                                              //  0x0018(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_CreateNavButtons_Params
    {
    public:
        bool                                                         Left;                                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Right;                                                   //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         WideSpacing;                                             //  0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0006[0x5];                                   //  0x0003(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FText                                            LeftButtonText;                                          //  0x0008(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        BasicTypes::FText                                            RightButtonText;                                         //  0x0020(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        BasicTypes::UScriptDelegate                                  LeftEvent;                                               //  0x0038(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        BasicTypes::UScriptDelegate                                  RightEvent;                                              //  0x0048(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_DestroyOldMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_DisableActiveMenuInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_EnableActiveMenuInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_SetupBaseball_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_SetupBowling_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ShutDown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_SetupTennis_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_Timeline_ScaleMenu__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_Timeline_ScaleMenu__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_SpawnFirstMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ScaleDownMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_HeaderDestroyed_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ScaleUpMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ButtonPressed_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_RecenterPlayer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_MenuInitComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_TravelCapsuleReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_NewRoundBegin_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_EnterPlayerName_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ChangeLevel_Params
    {
    public:
        BasicTypes::FName                                            Game;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_LevelReady_Params
    {
    public:
        BasicTypes::FName                                            NewGeoLevel;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_GetNextPlayerReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_NextPlayerReady_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_EnterNameMenuReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_CloseMenu_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_StartMiniGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_MiniGameDestroyed_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_MiniGameComplete_Params
    {
    public:
        ResultsData::FResultsData                                    Results;                                                 //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_BeginResults_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_EnterNameComplete_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_GetReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ShowScoreDisplayNavButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ShowScoreList_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_PnpComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ScoreDisplayCompleted_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_SetPreferences_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ReenableNavButtons_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_PnpPreferencesOpen_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_PnpPreferencesSet_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ThrowingHandOpen_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ThrowingHandDone_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_CheckThrowing_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_CheckBatting_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_BattingOpen_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_BattingComplete_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_HandSwapNeeded_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ScoreListReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ScoreListComplete_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_StringUpdated_Params
    {
    public:
        bool                                                         Empty;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_ExecuteUbergraph_GameHandlerPnp_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0007[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_NewMenuReady__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerPnp_C_MenuOpened__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
