#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "OnlineGameHandlerClientStates_ENUMS.h"
#include "BasicTypes_UScriptDelegate.h"
#include "BasicTypes_FName.h"
#include "BasicTypes_FText.h"
#include "ResultsData_FResultsData.h"
#include "GameResult_ENUMS.h"
#include "SportsScramble_ENUMS.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::SportsScramble { class AScramPlayer; };
namespace CG::Menu_MpSportIcon { class AMenu_MpSportIcon_C; };
namespace CG::Engine { class AActor; };
namespace CG::SportsScramble { class AScramPlayerController; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::GameHandlerOnline
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RemoveErrorMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ClosePauseMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_FailsafeDoubleMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RepairLocalClientState_Params
    {
    public:
        OnlineGameHandlerClientStates::EOnlineGameHandlerClientStates NewClientState;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_UnbindPause_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_BindPause_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_CheckRemotePlayerClientState_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  RemotePlayerClientState;                                 //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ResetStatusBools_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnExitButton_Params
    {
    public:
        bool                                                         StaticPosition;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::UScriptDelegate                                  ExitEvent;                                               //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ShowMenus_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_HideMenus_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RemoveAvatarButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnAvatarButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnConfirmationMenu_Params
    {
    public:
        BasicTypes::FName                                            LocText;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FText                                            OverrideText;                                            //  0x0008(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        BasicTypes::UScriptDelegate                                  Selection;                                               //  0x0020(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        bool                                                         Static;                                                  //  0x0030(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnTextTwoMenu_Params
    {
    public:
        BasicTypes::FName                                            LocText0;                                                //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            LocText1;                                                //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::UScriptDelegate                                  SelectionFinished;                                       //  0x0010(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_PlayerReady_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Ready;                                                   //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnSportOptionsMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnChooseSportMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  ChoiceEvent;                                             //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SetFindMatchGameOptions_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnBowlingGloves_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnMessageMenu_Params
    {
    public:
        BasicTypes::FText                                            Text;                                                    //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        bool                                                         Static;                                                  //  0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnAwardMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  AwardReadyEvent;                                         //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_AwardsEarned_Params
    {
    public:
        bool                                                         AwardWaiting;                                            //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnResultsMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  ResultsCompleteEvent;                                    //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        ResultsData::FResultsData                                    ResultsData;                                             //  0x0010(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_PrepSport_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RevealRemoteAvatar_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnGameManager_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnSportIconMenu_Params
    {
    public:
        Menu_MpSportIcon::AMenu_MpSportIcon_C*                       Menu;                                                    //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x8];                                   //  0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnMpReadyMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnAvatarChoiceMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_NextMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RemoveNavigationButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_DisableActiveMenuInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnNavigationButtons_Params
    {
    public:
        bool                                                         Ok;                                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0003[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::UScriptDelegate                                  OkEvent;                                                 //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        bool                                                         WideSpacing;                                             //  0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Next;                                                    //  0x0019(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0004[0x6];                                   //  0x001A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::UScriptDelegate                                  NextEvent;                                               //  0x0020(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        bool                                                         Trophy;                                                  //  0x0030(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Home;                                                    //  0x0031(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         FocusNext;                                               //  0x0032(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_EnableActiveMenuInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnHeader_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  InitialMenuEvent;                                        //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        bool                                                         StartOpen;                                               //  0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_Timeline_MenuScale__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_Timeline_MenuScale__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnFailure_CB7A18C444F2E804805EC3A08673C765_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnSuccess_CB7A18C444F2E804805EC3A08673C765_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnFailure_FE43AE584DB619A31AB35583C4B33B9D_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnSuccess_FE43AE584DB619A31AB35583C4B33B9D_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_InitialMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ScaleUpMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ScaleDownMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ButtonPressed_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_HomeButtonPressed_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_AvatarChoiceMenuOpened_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_AvatarSelected_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnReadyMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ReadyMenuOpened_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_AllPlayersReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_CloseReadyMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnIconMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_TennisMatchComplete_Params
    {
    public:
        GameResult::EGameResult                                      Result;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ShowResults_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_GameOver_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnCapsule_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_CapsuleOn_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SetResults_Params
    {
    public:
        GameResult::EGameResult                                      ResultsGameResult;                                       //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_TrophyComplete_Params
    {
    public:
        bool                                                         AllAwardsComplete;                                       //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_TrophyReadyToSpawn_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_CreateTrophyMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_TrophyLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_CreateNextFromResultsButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ResultsDoneSelected_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RemotePlayerReplayRequested_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RestartMatch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_WaitingForRematch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_WaitingForRematchDisplayed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_DoNothing_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_BowlingMatchComplete_Params
    {
    public:
        GameResult::EGameResult                                      MatchResult;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0005[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      Player1GamesWon;                                         //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Player2GamesWon;                                         //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_BaseballMatchComplete_Params
    {
    public:
        bool                                                         LocalPlayerVictory;                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0006[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      AwayScore;                                               //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      HomeScore;                                               //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_HeaderHandoffComplete_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnAvatarMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SportOptionsSelected_Params
    {
    public:
        SportsScramble::EScramSport                                  Sport;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         BBHostIsHomeTeam;                                        //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SportChosen_Params
    {
    public:
        SportsScramble::EScramSport                                  Sport;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnGameOptionsMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SportOptionsMenuDisplayed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SportOptionsChosen_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnGeoLevelChanged_Params
    {
    public:
        BasicTypes::FName                                            NewGeoLevel;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_PlayerInitComplete_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnMatchStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_FadeComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ShutDown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnInitialPlayerInitComplete_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnRemoteAvatarSelected_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ResultsDisplayComplete_Params
    {
    public:
        bool                                                         WideNextButton;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_PlayMatchBeginAudio_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_HeartbeatConnected_Params
    {
    public:
        SportsScramble::AScramPlayerController*                      PlayerController;                                        //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_HeartbeatDisconnected_Params
    {
    public:
        SportsScramble::AScramPlayerController*                      PlayerController;                                        //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_HeartbeatTravelCapsuleClosed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_HeartbeatReconnected_Params
    {
    public:
        SportsScramble::AScramPlayerController*                      PlayerController;                                        //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnMenuInstruments_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_Net_AllPlayersReconnected_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnDisconnect_Local_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnDisconnect_Remote_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnDisconnect_Remote_Menu0_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnDisconnect_Remote_Menu1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnGameOverMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnRematchOrResetMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RematchWithFriendSelectionMade_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RematchWithFriendOpened_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ReplayChooseSport_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_MulticastReselectSport_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnRematchMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RematchChoiceMenu_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_DisconnectPauseEvent_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_MatchBeginning_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnNetworkFailure_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_TrySpawnNetworkFailureMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnNetworkFailureMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_NetworkFailureTravelCapsuleClosed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_GamePaused_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_GameUnpaused_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OnRemoteAvatarUnselected_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ExitConfirmResult_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_WaitinForHostMessageReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_QuitSelectedPauseMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OverrideHostReady_Params
    {
    public:
        bool                                                         Ready;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OverrideClientReady_Params
    {
    public:
        bool                                                         Ready;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RemotePlayerReadyAgain_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_QuitViaPause_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ResetFromPauseMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SendClientExpectedState_Params
    {
    public:
        OnlineGameHandlerClientStates::EOnlineGameHandlerClientStates ExpectedClientState;                                     //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SendHostExpectedState_Params
    {
    public:
        OnlineGameHandlerClientStates::EOnlineGameHandlerClientStates ExpectedClientState;                                     //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RequestHostExpectedState_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RequestClientExpected_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SportOptionsSelectedClientOnly_Params
    {
    public:
        SportsScramble::EScramSport                                  Sport;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         BBHostIsHomeTeam;                                        //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_RequestSportOptionsSelected_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ForfeitResults_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnChooseSport_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_InitialMessageDisplayed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ShowConnctionMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_NetworkFailureExit_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SpawnNetworkFailure_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_PlayForfeitMusic_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_MatchBeginTravelCapsuleOpened_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ServerReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_Multi_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_BackToChooseSport_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_StartTravel_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SetClientCanTravel_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_BeginMatch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_SetClientCanBeginMatch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_Multi_BeginMatchOpenCapsule_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ExecuteUbergraph_GameHandlerOnline_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0007[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_ReturnExpectedClientState__DelegateSignature_Params
    {
    public:
        OnlineGameHandlerClientStates::EOnlineGameHandlerClientStates RemotePlayerExpectedClientState;                         //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_OldMenuClear__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AGameHandlerOnline_C_MenuOpened__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
