#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BB_ScoreboardVideos_ENUMS.h"
#include "BasicTypes_UScriptDelegate.h"
#include "SportsScramble_ENUMS.h"
#include "CoreUObject_FVector.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class UMaterialInstance; };
namespace CG::SportsScramble { class AScramBall; };
namespace CG::SportsScramble { class AScramInstrument; };
namespace CG::Engine { class AActor; };
namespace CG::SportsScramble { class AScramBaseballRunnerAI; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::HRD_Challenge_Manager
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_FinalizeChallengeScore_Params
    {
    public:
        int32_t                                                      RunnersYetToScore;                                       //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_TryLaunchBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_UpdateLauncherSpeed_Params
    {
    public:
        float                                                        MinSpeed;                                                //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        float                                                        MaxSpeed;                                                //  0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_UpdateScoreboardNames_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_SpawnLogoPopup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_PlayScoreboardVideo_Params
    {
    public:
        BB_ScoreboardVideos::EBB_ScoreboardVideos                    Animation;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_SetGameSettings_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_HideIndicators_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_GetBattingMaterial_Params
    {
    public:
        Engine::UMaterialInstance*                                   Material;                                                //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_GetFieldingMaterial_Params
    {
    public:
        Engine::UMaterialInstance*                                   Material;                                                //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_RunnerScores_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_GetWinningPlayer_Params
    {
    public:
        int32_t                                                      WinnerInt;                                               //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_EndGameCleanUp_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_SpawnLocalHelper_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_ToggleTeamColors_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_SpawnTeamActors_Params
    {
    public:
        bool                                                         FieldersOnly;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_SetupScoreboards_Params
    {
    public:
        int32_t                                                      BallsCount;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      StrikesCount;                                            //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_CleanUpGameElements_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_PitcherScoring_Params
    {
    public:
        int32_t                                                      score;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_BatterScoring_Params
    {
    public:
        int32_t                                                      ScoreAmount;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_TeleportPlayer_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  TransitionReady;                                         //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        BasicTypes::UScriptDelegate                                  TransitionComplete;                                      //  0x0010(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        bool                                                         UseTransitionDuration;                                   //  0x0020(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_SpawnAndSetEquipment_Params
    {
    public:
        SportsScramble::AScramBall*                                  BallClass;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::AScramInstrument*                            InstrumentClass;                                         //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_SpawnAiPitcher_Params
    {
    public:
        Engine::AActor*                                              PitcherActor;                                            //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_BaseballEvent_Params
    {
    public:
        SportsScramble::EBaseballEvent                               BaseballEvent;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FVector                                         Location;                                                //  0x0004(0x000C)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_LocalHelperMessageComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_OnRunnerSpawned_Params
    {
    public:
        SportsScramble::AScramBaseballRunnerAI*                      runner;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_CheckForPlayerBattingPosition_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_PlayerBatterReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_BeginGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_UpdateGameScore_Params
    {
    public:
        int32_t                                                      NewP1TotalScore;                                         //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      NewP2TotalScore;                                         //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_Single_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_Double_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_Triple_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_HomeRun_Params
    {
    public:
        bool                                                         BasesLoaded;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_RegisterCatch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_RegisterFoul_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_UpdateRunners_Params
    {
    public:
        bool                                                         NewRunnerOnFirst;                                        //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         NewRunnerOnSecond;                                       //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         NewRunnerOnThird;                                        //  0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_ShowPauseInfo_Params
    {
    public:
        bool                                                         IsPaused;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         WasPausedByMe;                                           //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_ShowPauseBubble_Params
    {
    public:
        bool                                                         IsPaused;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_OnGameResume_Params
    {
    public:
        bool                                                         WasPausedByMe;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_OnGamePause_Params
    {
    public:
        bool                                                         WasPausedByMe;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_SpawnInitialActors_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_NetSetupScoreboards_Params
    {
    public:
        int32_t                                                      BallsCount;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      StrikesCount;                                            //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_NetDisplayPopup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_EndGame_Params
    {
    public:
        float                                                        ScoreDelay;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_GameRunLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_ExecuteUbergraph_HRD_Challenge_Manager_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_RunnersReady__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_PlayerHitHomerun__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_PlayerScoredRun__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_TeleportComplete__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHRD_Challenge_Manager_C_GameCompleted__DelegateSignature_Params
    {
    public:
        int32_t                                                      PlayerScore;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      HomeRunCount;                                            //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
