#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "HubMenuChoices_ENUMS.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::HubMenu
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_SpawnBeacons_Params
    {
    public:
        HubMenuChoices::EHubMenuChoices                              SingleBeacon;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_ResetMenus_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_CleanUpSelectors_Params
    {
    public:
        HubMenuChoices::EHubMenuChoices                              KeepSelection;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_BndEvt__ScramLookAtActivator_K2Node_ComponentBoundEvent_0_ScramLookAtActivatorDelegate__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_BndEvt__ScramLookAtActivator_K2Node_ComponentBoundEvent_1_ScramLookAtActivatorDelegate__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_BndEvt__ScramLookAtActivator_Baseball_K2Node_ComponentBoundEvent_0_ScramLookAtActivatorDelegate__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_BndEvt__ScramLookAtActivator_Bowling_K2Node_ComponentBoundEvent_1_ScramLookAtActivatorDelegate__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_BndEvt__ScramLookAtActivator_BASEBALL_K2Node_ComponentBoundEvent_2_ScramLookAtActivatorDelegate__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_BndEvt__ScramLookAtActivator_BOWLING_K2Node_ComponentBoundEvent_3_ScramLookAtActivatorDelegate__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_BndEvt__ScramLookAtActivator_MULTIPLAYER_K2Node_ComponentBoundEvent_4_ScramLookAtActivatorDelegate__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_BndEvt__ScramLookAtActivator_MULTIPLAYER_K2Node_ComponentBoundEvent_5_ScramLookAtActivatorDelegate__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_BndEvt__ScramLookAtActivator_TROPHYROOM_K2Node_ComponentBoundEvent_6_ScramLookAtActivatorDelegate__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_BndEvt__ScramLookAtActivator_TROPHYROOM_K2Node_ComponentBoundEvent_7_ScramLookAtActivatorDelegate__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_SelectionMade_Params
    {
    public:
        HubMenuChoices::EHubMenuChoices                              Selection;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_SpawnTennis_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_SpawnBaseball_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_SpawnBowling_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_SpawnMultiplayer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_SpawnTrophy_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_SelectionFinished_Params
    {
    public:
        HubMenuChoices::EHubMenuChoices                              Selection;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_EndNux_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_ShutDownMenuExternal_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_PlaySelectionAudio_Params
    {
    public:
        HubMenuChoices::EHubMenuChoices                              Choice;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_BeaconsRaised_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_ActivateLookAt_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_TennisButtonDestroyed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_BaseballButtonDestroyed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_BowlingButtonDestroyed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_MultiplayerButtonDestroyed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_TrophyButtonDestroyed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_ExecuteUbergraph_HubMenu_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_SelectionStarted__DelegateSignature_Params
    {
    public:
        HubMenuChoices::EHubMenuChoices                              Choice;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        Angle;                                                   //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AHubMenu_C_HubMenuSelection__DelegateSignature_Params
    {
    public:
        HubMenuChoices::EHubMenuChoices                              Selection;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
