#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::IntroSetup
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_SpawnCompleteButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_SpawnAvatarMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_PlayVoiceSelectionMade_Params
    {
    public:
        int32_t                                                      Choice;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_PlayVoiceMenuOpen_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_UpdateChoice_Params
    {
    public:
        int32_t                                                      Choice;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Progress;                                                //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_SpawnButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_SpawnHeader_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_MenuVisibility_Params
    {
    public:
        bool                                                         Visibility;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_Timeline_MenuScale__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_Timeline_MenuScale__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_SelectionMade_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_CloseMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_ButtonSwapped_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_OpenMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_HeaderDestroyed_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_DelayedChoiceEffect_Params
    {
    public:
        int32_t                                                      Choice;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Progress;                                                //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_PlayDelayedVoice_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_CompleteButtonSwapped_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_AvatarSetupAnimComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_ExecuteUbergraph_IntroSetup_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AIntroSetup_C_ChoiceMade__DelegateSignature_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
