#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_ENUMS.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::MainMenuStand
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_DisableButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_SpawnButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_Timeline_MovePanel__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_Timeline_MovePanel__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_Timeline_MoveRoot__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_Timeline_MoveRoot__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_ButtonPressed_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_SwapFinished_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_OpenPanel_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_ClosePanel_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_LowerStand_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_ButtonTouched_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_ButtonUntouched_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_Play_SFX_Menu_Raise_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_Play_SFX_Menu_Lower_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_ExecuteUbergraph_MainMenuStand_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_MenuOpened__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_SelectionComplete__DelegateSignature_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMainMenuStand_C_SelectionStarted__DelegateSignature_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
