#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FText.h"
#include "CoreUObject_FVector.h"
#include "Engine_ENUMS.h"
#include "BB_SoundQueueStruct_FBB_SoundQueueStruct.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::ManagerBaseball_LocalHelper
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_DisplayPitchOrBatIntro_Params
    {
    public:
        bool                                                         IsLocalPlayerServe;                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      GameCount;                                               //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_DisplayInfo_Params
    {
    public:
        BasicTypes::FText                                            Text;                                                    //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        float                                                        DisplayTime;                                             //  0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x4];                                   //  0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_PlayBatterScoreSound_Params
    {
    public:
        bool                                                         IsLocalPlayerBatting;                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_PlayPitcherScoreSound_Params
    {
    public:
        bool                                                         IsLocalPlayerBatting;                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_PlayBatterSingleSound_Params
    {
    public:
        bool                                                         IsLocalPlayerBatting;                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_PlayBatterDoubleSound_Params
    {
    public:
        bool                                                         IsLocalPlayerBatting;                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_PlayBatterTripleSound_Params
    {
    public:
        bool                                                         IsLocalPlayerBatting;                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_PlayBatterHomerunSound_Params
    {
    public:
        bool                                                         IsLocalPlayerBatting;                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         GrandSlam;                                               //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_OutOneSound_Params
    {
    public:
        bool                                                         IsLocalPlayerBatting;                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_OutTwoSound_Params
    {
    public:
        bool                                                         IsLocalPlayerBatting;                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_OutThreeSound_Params
    {
    public:
        bool                                                         IsLocalPlayerBatting;                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_GetReadyText_Params
    {
    public:
        bool                                                         IsLocalPlayerBatting;                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        DisplayTime;                                             //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         TopOfTheInning;                                          //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0003[0x3];                                   //  0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      Inning;                                                  //  0x000C(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_AnnounceWinner_Params
    {
    public:
        bool                                                         LocalPlayerIsHomeTeam;                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0004[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      WinnerInt;                                               //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_DisplayStartOfMatchInfo_Params
    {
    public:
        int32_t                                                      Innings;                                                 //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         IsLocalPlayerBatting;                                    //  0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_TeleportMusic_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_PlayBallSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_FoulBallSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_UmpireOut_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_MIttCatchSound_Params
    {
    public:
        CoreUObject::FVector                                         BallLocation;                                            //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_BallSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_HereThePitchSFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_UmpireStrikeSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_BrokenBatAnnouncement_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_GetNewBatAnnouncement_Params
    {
    public:
        bool                                                         IsLocalPlayerBatting;                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_SwitchSidesSound_Params
    {
    public:
        float                                                        DisplayTime;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_MoveToFootIndicators_Params
    {
    public:
        bool                                                         IsLocalPlayerBatting;                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_QueueSound_Params
    {
    public:
        BB_SoundQueueStruct::FBB_SoundQueueStruct                    SoundParams;                                             //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_QueuePlayNext_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_HomeRun_Fireworks_VFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_AnnouncerStrike_Params
    {
    public:
        int32_t                                                      Strike;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_ExecuteUbergraph_ManagerBaseball_LocalHelper_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBaseball_LocalHelper_C_FinishedReadyMessage__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
