#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FText.h"
#include "Engine_ENUMS.h"
#include "GameResult_ENUMS.h"
#include "CoreUObject_FVector.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Countdown { class ACountdown_C; };
namespace CG::Engine { class USoundBase; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::ManagerBowling_LocalHelper
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_DisplayCountdown_Params
    {
    public:
        Countdown::ACountdown_C*                                     CountdownActor;                                          //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_DisplayInfo_Params
    {
    public:
        BasicTypes::FText                                            DisplayText;                                             //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        float                                                        DisplayTime;                                             //  0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_Cleanup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_PlayAudienceDisappointed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_CrowdApplause_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_DisplayStartOfMatchInfo_Params
    {
    public:
        int32_t                                                      GamesToWin;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_DisplayNextGame_Params
    {
    public:
        int32_t                                                      PreviousGameWinner;                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Game;                                                    //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_DisplayMatchOver_Params
    {
    public:
        GameResult::EGameResult                                      GameResult;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_PlayAnnouncerBallChange_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_PlayAnnouncerVO_Params
    {
    public:
        Engine::USoundBase*                                          AnnouncerVO;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_PlinkoLaunchSFX_Params
    {
    public:
        CoreUObject::FVector                                         Location;                                                //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_DisplayAlternateMatchInfo_Params
    {
    public:
        int32_t                                                      GamesToWin;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_DisplayPlayerTurnStart_Params
    {
    public:
        int32_t                                                      Player;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_DisplayPlayerTurnEnd_Params
    {
    public:
        int32_t                                                      Player;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_DisplayStartOfTraditionalMatchInfo_Params
    {
    public:
        int32_t                                                      Frames;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AManagerBowling_LocalHelper_C_ExecuteUbergraph_ManagerBowling_LocalHelper_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
