#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_ENUMS.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Menu_AvatarSetup
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_EnableMenuInput_Params
    {
    public:
        bool                                                         InputEnabled;                                            //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_DisableMenuInput_Params
    {
    public:
        bool                                                         InputDisabled;                                           //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_RemoveSubMenu_Params
    {
    public:
        bool                                                         Removed;                                                 //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_HideSubMenu_Params
    {
    public:
        bool                                                         MenuHidden;                                              //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_RestoreSubMenu_Params
    {
    public:
        bool                                                         MenuShown;                                               //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_UpdateAvatarText_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_SetRed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_ShutDown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_UpdateAvatar_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_UpdateHairColor_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_UpdateSkinColor_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_SaveAvatarLook_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_Timeline_Rotation__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_Timeline_Rotation__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_Timeline_BackingScale__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_Timeline_BackingScale__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_Timeline_MoveAvatar__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_Timeline_MoveAvatar__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_Timeline_ScaleMesh__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_Timeline_ScaleMesh__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_Timeline_ScaleAvatar__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_Timeline_ScaleAvatar__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_PreviousAvatar_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_NextAvatar_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_PreviousSkin_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_NextSkin_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_PreviousHair_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_NextHair_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_InitialSetupComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_Play_SFX_Avatar_Intro_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_ExecuteUbergraph_Menu_AvatarSetup_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_AvatarSetup_C_InitialSetupAnimComplete__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
