#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FText.h"
#include "Engine_ENUMS.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Menu_Results
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_EnableMenuInput_Params
    {
    public:
        bool                                                         InputEnabled;                                            //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_DisableMenuInput_Params
    {
    public:
        bool                                                         InputDisabled;                                           //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_RemoveSubMenu_Params
    {
    public:
        bool                                                         Removed;                                                 //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_HideSubMenu_Params
    {
    public:
        bool                                                         MenuHidden;                                              //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_RestoreSubMenu_Params
    {
    public:
        bool                                                         MenuShown;                                               //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_SwapToRed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_RevealHighScore_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_AvatarsReact_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_SpawnAvatars_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_ShowTrophyIcon_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_SwapToGold_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_GetTitleText_Params
    {
    public:
        BasicTypes::FText                                            Title;                                                   //  0x0000(0x0018)  (Parm, OutParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_ScaleBox__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_ScaleBox__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_SwapBoxText__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_SwapBoxText__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_ShowHighScore__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_ShowHighScore__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_MoveTitle__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_MoveTitle__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_ShowInnerMessage__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_ShowInnerMessage__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_SwapBoxBump__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_SwapBoxBump__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_ScaleAvatars__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_ScaleAvatars__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_MoveAvatars__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_MoveAvatars__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_ScaleMessage__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_ScaleMessage__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_SwapBox__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_SwapBox__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_ScaleBoxBump__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_Timeline_ScaleBoxBump__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_RevealBox_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_ShowScore_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_ShowHighScore_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_MoveMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_ShowInnerMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_ShowFinalMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_FinishFinalMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_BeginResultsDisplay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_MoveAvatars_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_DisplayMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_PlayFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_PlayRedFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_DelayedYellowPulse_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_ExecuteUbergraph_Menu_Results_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMenu_Results_C_ResultsDisplayComplete__DelegateSignature_Params
    {
    public:
        bool                                                         WideNextButton;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
