#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "MovieSceneCapture_ENUMS.h"
#include "BasicTypes_FName.h"
#include "BasicTypes_UScriptDelegate.h"
#include "MovieSceneCapture_FFrameMetrics.h"
#include "BasicTypes_FString.h"
#include "MovieSceneCapture_FCapturedPixels.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::MovieSceneCapture { class UMovieSceneCaptureProtocolBase; };
namespace CG::MovieSceneCapture { class UMovieSceneImageCaptureProtocolBase; };
namespace CG::MovieSceneCapture { class UMovieSceneAudioCaptureProtocolBase; };
namespace CG::Engine { class UTexture; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::MovieSceneCapture
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UMovieSceneCaptureProtocolBase_IsCapturing_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMovieSceneCaptureProtocolBase_GetState_Params
    {
    public:
        MovieSceneCapture::EMovieSceneCaptureProtocolState           ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMovieSceneCapture_SetImageCaptureProtocolType_Params
    {
    public:
        MovieSceneCapture::UMovieSceneCaptureProtocolBase*           ProtocolType;                                            //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMovieSceneCapture_SetAudioCaptureProtocolType_Params
    {
    public:
        MovieSceneCapture::UMovieSceneCaptureProtocolBase*           ProtocolType;                                            //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMovieSceneCapture_GetImageCaptureProtocol_Params
    {
    public:
        MovieSceneCapture::UMovieSceneCaptureProtocolBase*           ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMovieSceneCapture_GetAudioCaptureProtocol_Params
    {
    public:
        MovieSceneCapture::UMovieSceneCaptureProtocolBase*           ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMovieSceneCaptureEnvironment_IsCaptureInProgress_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMovieSceneCaptureEnvironment_GetCaptureFrameNumber_Params
    {
    public:
        int32_t                                                      ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMovieSceneCaptureEnvironment_GetCaptureElapsedTime_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMovieSceneCaptureEnvironment_FindImageCaptureProtocol_Params
    {
    public:
        MovieSceneCapture::UMovieSceneImageCaptureProtocolBase*      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMovieSceneCaptureEnvironment_FindAudioCaptureProtocol_Params
    {
    public:
        MovieSceneCapture::UMovieSceneAudioCaptureProtocolBase*      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_StopCapturingFinalPixels_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_StartCapturingFinalPixels_Params
    {
    public:
        BasicTypes::FName                                            StreamName;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_ResolveBuffer_Params
    {
    public:
        Engine::UTexture*                                            Buffer;                                                  //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            BufferName;                                              //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::UScriptDelegate                                  Handler;                                                 //  0x0010(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_PushBufferToStream_Params
    {
    public:
        Engine::UTexture*                                            Buffer;                                                  //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            StreamName;                                              //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_OnWarmUp_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_OnTick_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_OnStartCapture_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_OnSetup_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_OnPreTick_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_OnPauseCapture_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_OnFinalize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_OnCaptureFrame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_OnCanFinalize_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_OnBeginFinalize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_GetCurrentFrameMetrics_Params
    {
    public:
        MovieSceneCapture::FFrameMetrics                             ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_GenerateFilename_Params
    {
    public:
        MovieSceneCapture::FFrameMetrics                             InFrameMetrics;                                          //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          ReturnValue;                                             //  0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedCaptureProtocol_BindToStream_Params
    {
    public:
        BasicTypes::FName                                            StreamName;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::UScriptDelegate                                  Handler;                                                 //  0x0008(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedImageCaptureProtocol_WriteImageToDisk_Params
    {
    public:
        MovieSceneCapture::FCapturedPixels                           PixelData;                                               //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            StreamName;                                              //  0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieSceneCapture::FFrameMetrics                             FrameMetrics;                                            //  0x0018(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         bCopyImageData;                                          //  0x0028(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedImageCaptureProtocol_GenerateFilenameForCurrentFrame_Params
    {
    public:
        BasicTypes::FString                                          ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUserDefinedImageCaptureProtocol_GenerateFilenameForBuffer_Params
    {
    public:
        Engine::UTexture*                                            Buffer;                                                  //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            StreamName;                                              //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          ReturnValue;                                             //  0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
