#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_TArray.h"
#include "BasicTypes_FString.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::MultiplayerMenu
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_SessionsFound_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FString>                      SessionsFound;                                           //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_NoSessionsFound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_UnbindFromInstance_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_CreateButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_ChoiceMade_Params
    {
    public:
        int32_t                                                      ButtonSelected;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_JoinFailed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_JoinSuccess_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_GameSelected_Params
    {
    public:
        int32_t                                                      ButtonSelected;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_SpawnTypeSelectionMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_GetSessions_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_CreateSportButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_SportChosen_Params
    {
    public:
        int32_t                                                      ButtonSelected;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_AvatarDone_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_ExecuteUbergraph_MultiplayerMenu_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AMultiplayerMenu_C_BackButtonSelected__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
