#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FString.h"
#include "BasicTypes_FText.h"
#include "CoreUObject_FTransform.h"
#include "InputCore_FKey.h"
#include "Engine_ENUMS.h"
#include "OnlineSubsystemUtils_FBlueprintSessionResult.h"
#include "BasicTypes_FName.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class APlayerController; };
namespace CG::Engine { class AActor; };
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };
namespace CG::TN_Ball_Base { class ATN_Ball_Base_C; };
namespace CG::Engine { class AController; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::OCDemo_StagingBP
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SkipToJoinSetup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_DebugText_Params
    {
    public:
        BasicTypes::FString                                          Message;                                                 //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
        float                                                        LifeTime;                                                //  0x0010(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_DisplayTubeText_Params
    {
    public:
        BasicTypes::FText                                            Text;                                                    //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        bool                                                         InstantSwap;                                             //  0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_RemoveCapsule_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_RemoveMinigame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SpawnMiniGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_DebugSkip_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SpawnCapsule_Params
    {
    public:
        bool                                                         Instant;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0xF];                                   //  0x0001(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FTransform                                      SpawnTransform;                                          //  0x0010(0x0030)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SetupButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SpectatorInit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_HideCourt_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_RevealCourt_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SetSmallPlayArea_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SetLargePlayArea_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_CheckInBounds_Params
    {
    public:
        float                                                        XLocation;                                               //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        float                                                        YLocation;                                               //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         InBounds;                                                //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_DestroyHint_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SpawnHint_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_DestroyAllBalls_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_PlayPreShotAudio_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SetWarmupShotList_Params
    {
    public:
        bool                                                         FirstSet;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0002[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_Cleanup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_Timeline_RaiseNet__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_Timeline_RaiseNet__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_InpActEvt_Y_K2Node_InputActionEvent_1_Params
    {
    public:
        InputCore::FKey                                              Key;                                                     //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_OnFailure_2468308E4647630D021BFFAD2DCAB6C2_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_OnSuccess_2468308E4647630D021BFFAD2DCAB6C2_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SpawnDebugButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_OpenDebugMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_CloseDebugMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_DebugButtonsSelected_Params
    {
    public:
        int32_t                                                      ButtonSelected;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_RacketSelected_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_BeginWarmup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ClientJoined_Params
    {
    public:
        Engine::APlayerController*                                   NewPlayer;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         IsSpectator;                                             //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_BallLaunchedWarmup_Params
    {
    public:
        Engine::AActor*                                              Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_BallHitWarmup_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_WarmupLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_BeginMatch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SetupWarmup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_WarmupComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_RaiseNet_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_CourtSetup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ModeSelected_Params
    {
    public:
        int32_t                                                      ButtonSelected;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_InstructionsLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_WaitForOpponentHost_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_DestroyBall_Params
    {
    public:
        TN_Ball_Base::ATN_Ball_Base_C*                               Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SpawnAttractParticle_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_RemoveAttractParticle_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_LoadMatch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_HostReadyTeleport_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_HostNotReadyTeleport_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ReadyForHint_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_DelayDestroyHint_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_DelayedCourtSizeInit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_LookForHost_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_HostNotFound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_HostFound_Params
    {
    public:
        OnlineSubsystemUtils::FBlueprintSessionResult                Session;                                                 //  0x0000(0x00B8)  (BlueprintVisible, BlueprintReadOnly, Parm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_PrepClientToJoin_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ClientTpReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ClientTpNotReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_JoinFailed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ClientReadyToJoin_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_Join_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_StagingComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_HitCheckComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SkipToEnd_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_PrepareForHosting_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ReadyToHost_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_WaitForOpponentClient_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_PrepareForClienting_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ReadyToClient_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_HostMinMiniGameTimeComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ClientMinMiniGameTimeComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_StartMiniGameHost_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SkipEndMiniGameHost_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_StartMiniGameClient_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SkipEndMiniGameClient_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_DumpTubeText_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ClientJoinedWaitingForHost_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ClientFadeOutComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ClientDelayedSetup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ClientRemoveTubeText_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ClientStadiumLoaded_Params
    {
    public:
        BasicTypes::FName                                            NewGeoLevel;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_SkipWarmup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ClientExit_Params
    {
    public:
        Engine::AController*                                         ExitingPlayer;                                           //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         IsSpectator;                                             //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_StagingBP_C_ExecuteUbergraph_OCDemo_StagingBP_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
