#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "GameResult_ENUMS.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AController; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::OCDemo_MatchBP
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_ErrorDisplay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_EndStaging_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_SpectatorInit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_SpawnEndGameAnnouncer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_SwapToMatchGeo_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_Timeline_Spectator1__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_Timeline_Spectator1__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_Timeline_LogoShrink__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_Timeline_LogoShrink__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_OnFailure_319135B942EBD7EBD66A10A04ECD0C78_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_OnSuccess_319135B942EBD7EBD66A10A04ECD0C78_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_OnFailure_5FEDCD4948BA4FA1F540408A3C581832_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_OnSuccess_5FEDCD4948BA4FA1F540408A3C581832_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_OnFailure_9A8600C5478761C6FCC392B8F9D61ED6_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_OnSuccess_9A8600C5478761C6FCC392B8F9D61ED6_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_Spec_CycleCameras_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_SpectatorExit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_PrepSpectatorForExit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_NewServe_Params
    {
    public:
        int32_t                                                      Game;                                                    //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Point;                                                   //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Player1Serve;                                            //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_TransitionReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_TransitionComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_Reset_Params
    {
    public:
        GameResult::EGameResult                                      Result;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_ShowAnnouncer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_AnnouncerLine13_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_RevealOpponent_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_ClosingAnnouncerComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_DoReveal_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_DoneRevealingOpponent_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_EndingAnnouncer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_ResetDemo_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_RevealAnimationCompleted_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_EndAnnouncerReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_HostReadyTeleport_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_FadeComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_NameAnnounce_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_FakeClipChange_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_ClientDisconnected_Params
    {
    public:
        Engine::AController*                                         ExitingPlayer;                                           //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         IsSpectator;                                             //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_AnnouncerExit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_StartMatch_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_PrepForTransition_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AOCDemo_MatchBP_C_ExecuteUbergraph_OCDemo_MatchBP_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
