#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_UScriptDelegate.h"
#include "BasicTypes_FString.h"
#include "BasicTypes_FName.h"
#include "SportsScramble_ENUMS.h"
#include "InputCore_FKey.h"
#include "Engine_ENUMS.h"
#include "BasicTypes_TArray.h"
#include "SportsScramble_FScramGameInvite.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class USceneComponent; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::PauseMenu
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnPointerButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_UpdatePointerType_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_RestartGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnRestartButton_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnSportOptionButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ShowDebugMsg_Params
    {
    public:
        BasicTypes::FString                                          Message;                                                 //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
        float                                                        LifeTime;                                                //  0x0010(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SetSport_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnJoinInviteMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  JoinEvent;                                               //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        BasicTypes::UScriptDelegate                                  DeclineAllEvent;                                         //  0x0010(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnGripButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnAvatarOptionsButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnAvatarMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnTrainingOpMenu_Params
    {
    public:
        bool                                                         GoWide;                                                  //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnTrainingOptionsButton_Params
    {
    public:
        bool                                                         Back;                                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SwapThrowingGlove_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SwapInstrumentHand_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ShowInstrument_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_HideInstrument_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_GetPnpPreferences_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_NextMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnConfirmationMenu_Params
    {
    public:
        BasicTypes::FName                                            LocText;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x8];                                   //  0x0018(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_UpdateVoiceSetting_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_RemoveNavButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ShowNoPauseIcon_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SaveOptions_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_EnableMenuInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnHeader_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_UpdateBoundarySetting_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_DestroyMenuActors_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_DisableMenuInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnQuarterPanel_Params
    {
    public:
        Engine::USceneComponent*                                     Loc;                                                     //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            LocString;                                               //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SetColumns_Params
    {
    public:
        bool                                                         HasAvatarButton;                                         //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_GetAnchors_Params
    {
    public:
        Engine::USceneComponent*                                     QpPos;                                                   //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        Engine::USceneComponent*                                     ButtonPos;                                               //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnBackButtons_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  EventBack;                                               //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnQuitButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnVoiceChatButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnSportButtons_Params
    {
    public:
        SportsScramble::EScramSport                                  Selection;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnSharedButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ResetGameSelector_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_GetDebugGameSelectors_Params
    {
    public:
        bool                                                         DebugSelectorExists;                                     //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         ResetAllowed;                                            //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0003[0x6];                                   //  0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_EndGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_Timeline_ScaleMenu__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_Timeline_ScaleMenu__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_InpActEvt_Pause_K2Node_InputActionEvent_1_Params
    {
    public:
        InputCore::FKey                                              Key;                                                     //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_OnFailure_CB7A18C444F2E804805EC3A042280AA5_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_OnSuccess_CB7A18C444F2E804805EC3A042280AA5_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_OnFailure_1BED71814B71FE0478E2F1AAE838DA9E_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_OnSuccess_1BED71814B71FE0478E2F1AAE838DA9E_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_OnFailure_FE43AE584DB619A31AB3558300E8F65D_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_OnSuccess_FE43AE584DB619A31AB3558300E8F65D_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_BoundaryLineChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_VoiceChatChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_PitcherHandChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_TennisHandChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_BattingSideChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_BattingHandChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_TennisSkillChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_BattingSkillChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_PitchingSkillChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_CatchingSkillChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_BowlingSkillChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_GripChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_TennisServeStyleChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_PointerTypeChanged_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_VoiceConfirmationConfirmed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ScaleUpMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ScaleDownMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_HeaderDestroyed_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_OpenFirstMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_TopMenuOpen_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_DisableInputOnButtonPress_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_CloseMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_CloseMenuButtonPressed_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SwapToVoiceConfirmation_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_QuitMultiplayer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnVoiceConfirmation_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_VoiceConfirmatinoButtonSelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ConfirmationMenuReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_BackToTop_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ShowForfeit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ForfeitConfirmationMade_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ForfeitSelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_QuitSelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SpawnTrainingOptions_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_TrainingOptionsSelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_TrainingOptionsOpened_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_CreateAvatarMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_AvatarButtonSelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_AvataMenuOpened_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_OpenMainOptionsMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_CreateJoinInviteMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_InvitesChecked_Params
    {
    public:
        bool                                                         wasSuccessful;                                           //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0004[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<SportsScramble::FScramGameInvite>         invites;                                                 //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_JoinGame_Params
    {
    public:
        SportsScramble::FScramGameInvite                             JoinPlayer;                                              //  0x0000(0x0060)  (BlueprintVisible, BlueprintReadOnly, Parm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_DeclineAll_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_JoinTheMatch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_NoInvitesFound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SportOptionsButtonPressed_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ShowSportOptions_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_SportOptionsOpened_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_RestartConfirmation_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_RestartConfirmationChoiceMade_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_RestartChallengeSelected_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_RecenterMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ClientUnrealJoinFailed_Params
    {
    public:
        SportsScramble::EScramPendingGameFailure                     failureType;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_UnrealJoinFailed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_ExecuteUbergraph_PauseMenu_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_PauseMenuCleared__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_PauseMenuOpened__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_UnPauseReady__DelegateSignature_Params
    {
    public:
        bool                                                         ForceKeepTravelCapsule;                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class APauseMenu_C_AllButtonsDestroyed__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
