#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "SportsScramble_ENUMS.h"
#include "SportsScramble_FBaseballInstrumentEntryProperties.h"
#include "BasicTypes_TArray.h"
#include "SportsScramble_FMittSpawnInfo.h"
#include "SportsScramble_FMinMaxAngle.h"
#include "BB_ScoreboardVideos_ENUMS.h"
#include "BasicTypes_UScriptDelegate.h"
#include "CoreUObject_FVector.h"
#include "Engine_ENUMS.h"
#include "SportsScramble_FAvatarLook.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::SportsScramble { class ABaseballInstrument; };
namespace CG::Engine { class UMaterialInstance; };
namespace CG::Engine { class USceneComponent; };
namespace CG::SportsScramble { class AScramBaseballBatterAI; };
namespace CG::SportsScramble { class AScramBaseballPitcherAI; };
namespace CG::Engine { class AActor; };
namespace CG::BB_Mitt { class ABB_Mitt_C; };
namespace CG::SportsScramble { class AScramBaseballRunnerAI; };
namespace CG::SportsScramble { class AScramBall; };
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::ScramSportManagerBaseball_Blueprint
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_GetRandomInstrument_Params
    {
    public:
        SportsScramble::EBaseballInstrumentType                      ExcludeType;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        SportsScramble::FBaseballInstrumentEntryProperties           NewInstrument;                                           //  0x0008(0x0040)  (Parm, OutParm)
        bool                                                         Successful;                                              //  0x0048(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_GetBatterRunAdvantage_Params
    {
    public:
        int32_t                                                      ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SaveBaseballState_Params
    {
    public:
        int32_t                                                      VisitorsScore;                                           //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      HomeScore;                                               //  0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Inning;                                                  //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         TopOfInning;                                             //  0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         FirstPitchOfInning;                                      //  0x000D(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x2];                                   //  0x000E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      Outs;                                                    //  0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Strikes;                                                 //  0x0014(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::ABaseballInstrument*                         BatterInstrument;                                        //  0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
        BasicTypes::TArray<SportsScramble::FMittSpawnInfo>           PitcherScrambleOptions;                                  //  0x0020(0x0010)  (Parm, OutParm, ZeroConstructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_GetGloveMaterial_Params
    {
    public:
        Engine::UMaterialInstance*                                   Material;                                                //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_GetFielderDifficulty_Params
    {
    public:
        SportsScramble::EDifficulty                                  NewParam;                                                //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SpawnFielder_Params
    {
    public:
        SportsScramble::EDifficulty                                  Difficulty;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::USceneComponent*                                     Position;                                                //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         IsOutfielder;                                            //  0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0003[0x3];                                   //  0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        SportsScramble::FMinMaxAngle                                 OutfieldMovementRange;                                   //  0x0014(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        uint8_t                                                      UnknownData_0004[0x4];                                   //  0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_BB_ChallengeGameSetup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_GetMittMaterial_Params
    {
    public:
        Engine::UMaterialInstance*                                   Material;                                                //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_AI_StrikeLooking_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_UpdateScoreboardNames_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SetPitchingTargetBindings_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SpawnLogoPopup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_RemoveRunners_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SetStrikezoneSize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_PlayScoreboardVideo_Params
    {
    public:
        BB_ScoreboardVideos::EBB_ScoreboardVideos                    Animation;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0005[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SetGameSettings_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_ChooseScrambleGroup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_ActivateBattingTee_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_HideIndicators_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_RequestAllowPitch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_HandleInstrumentBroken_Params
    {
    public:
        SportsScramble::ABaseballInstrument*                         Instrument;                                              //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SpawnInstrumentSelector_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_GetBattingMaterial_Params
    {
    public:
        Engine::UMaterialInstance*                                   Material;                                                //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_GetFieldingMaterial_Params
    {
    public:
        Engine::UMaterialInstance*                                   Material;                                                //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_RunnerScores_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_GetWinningPlayer_Params
    {
    public:
        int32_t                                                      WinnerInt;                                               //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_EndGameCleanUp_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SpawnLocalHelper_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_ToggleTeamColors_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SpawnTeamActors_Params
    {
    public:
        bool                                                         FieldersOnly;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SetupScoreboards_Params
    {
    public:
        int32_t                                                      BallsCount;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      StrikesCount;                                            //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_CleanUpGameElements_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_PitcherScoring_Params
    {
    public:
        int32_t                                                      score;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_UpdateOutsAndFreebies_Params
    {
    public:
        int32_t                                                      Outs;                                                    //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Freebies;                                                //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Strikes;                                                 //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_BatterScoring_Params
    {
    public:
        int32_t                                                      ScoreAmount;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_TeleportPlayer_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  TransitionReady;                                         //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        BasicTypes::UScriptDelegate                                  TransitionComplete;                                      //  0x0010(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        bool                                                         UseTransitionDuration;                                   //  0x0020(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_ProgressGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SpawnEquipmentAndAI_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SpawnStrikezone_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SpawnAiBatter_Params
    {
    public:
        SportsScramble::AScramBaseballBatterAI*                      Batter;                                                  //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SpawnAiPitcher_Params
    {
    public:
        SportsScramble::AScramBaseballPitcherAI*                     Pitcher;                                                 //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_Timeline_OrganFade__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_Timeline_OrganFade__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_BaseballEvent_Params
    {
    public:
        SportsScramble::EBaseballEvent                               BaseballEvent;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0006[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FVector                                         Location;                                                //  0x0004(0x000C)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_RegisterStrike_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_RegisterOut_Params
    {
    public:
        int32_t                                                      NewOuts;                                                 //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         PlayUmpireOut;                                           //  0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         PlayOrgan;                                               //  0x0005(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_HandleGameEnd_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_BBGameIntroSequence_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_LocalHelperMessageComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_BeginInning_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SetDominantHand_Params
    {
    public:
        Engine::AActor*                                              DominantHand;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BB_Mitt::ABB_Mitt_C*                                         Mitt;                                                    //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_OnRunnerSpawned_Params
    {
    public:
        SportsScramble::AScramBaseballRunnerAI*                      runner;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_StartOrgan_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_StopOrgan_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_CheckForPlayerBattingPosition_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_PlayerBatterReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_BeginGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_PitchTargetHit_Params
    {
    public:
        int32_t                                                      ScoreAmount;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_BatterHitOutfieldTarget_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      TargetId;                                                //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SendRestartGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_UpdateGameScore_Params
    {
    public:
        int32_t                                                      NewP1TotalScore;                                         //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      NewP2TotalScore;                                         //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SwitchSides_Params
    {
    public:
        bool                                                         TopOfTheInning;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0007[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      CurrentInning;                                           //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_Single_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_Double_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_Triple_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_HomeRun_Params
    {
    public:
        bool                                                         BasesLoaded;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_PlayFirstPitchSFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_RegisterCatch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_RegisterFoul_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_RegisterBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_UpdateRunners_Params
    {
    public:
        bool                                                         NewRunnerOnFirst;                                        //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         NewRunnerOnSecond;                                       //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         NewRunnerOnThird;                                        //  0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_OnInstrumentSelected_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_OnInstrumentBroken_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_PrepNewInning_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_BrokenBat_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_NewInstrumentSelected_Params
    {
    public:
        SportsScramble::ABaseballInstrument*                         Instrument;                                              //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_InstrumentSelected_Params
    {
    public:
        CoreUObject::UObject*                                        Instrument;                                              //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_OnInstrumentsSpawned_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_ShowPauseInfo_Params
    {
    public:
        bool                                                         IsPaused;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         WasPausedByMe;                                           //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_ShowPauseBubble_Params
    {
    public:
        bool                                                         IsPaused;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_OnGameResume_Params
    {
    public:
        bool                                                         WasPausedByMe;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_OnGamePause_Params
    {
    public:
        bool                                                         WasPausedByMe;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SpawnInitialActors_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_GameReadyToBegin_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_NetSetupScoreboards_Params
    {
    public:
        int32_t                                                      BallsCount;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      StrikesCount;                                            //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_RegisterStrikeout_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_NetUpdateOutsAndFreebies_Params
    {
    public:
        int32_t                                                      Outs;                                                    //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Freebies;                                                //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Strikes;                                                 //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_ResetCount_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_PitchingTargetsUpdated_Params
    {
    public:
        bool                                                         TL;                                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         TR;                                                      //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         BL;                                                      //  0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         BR;                                                      //  0x0003(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_PitchingTargetHit_Params
    {
    public:
        SportsScramble::EBaseballScrambleTargetLocations             Location;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_NetDisplayPopup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SetAILook_Params
    {
    public:
        SportsScramble::FAvatarLook                                  AvatarLook;                                              //  0x0000(0x0020)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_BB_ChallengeGameStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SpawnAiPitcherDelayed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_SpawnAiBatterDelayed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_PlayErrorSfx_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_LoadBaseballState_Params
    {
    public:
        int32_t                                                      VisitorsScore;                                           //  0x0000(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      HomeScore;                                               //  0x0004(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Inning;                                                  //  0x0008(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         TopOfInning;                                             //  0x000C(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         FirstPitchOfInning;                                      //  0x000D(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0008[0x2];                                   //  0x000E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      Outs;                                                    //  0x0010(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Strikes;                                                 //  0x0014(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::ABaseballInstrument*                         BatterInstrument;                                        //  0x0018(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
        BasicTypes::TArray<SportsScramble::FMittSpawnInfo>           PitcherScrambleOptions;                                  //  0x0020(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_ServerReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_Multi_UpdateScoreboardInning_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_Multi_SetInning_Params
    {
    public:
        int32_t                                                      Inning;                                                  //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Top;                                                     //  0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_OnGameDone_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_ShowMitt_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_NetDisablePause_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_DisablePause_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_ExecuteUbergraph_ScramSportManagerBaseball_Blueprint_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0009[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_GameCompleted__DelegateSignature_Params
    {
    public:
        bool                                                         LocalPlayerVictory;                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0010[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      AwayScore;                                               //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      HomeScore;                                               //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramSportManagerBaseball_Blueprint_C_OnSidesSwitchedDispatcher__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
