#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "SportsScramble_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AController; };
namespace CG::Engine { class APlayerController; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::ScramGameMode_BP
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AScramGameMode_BP_C_ServerForceUpdateDormancy_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramGameMode_BP_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramGameMode_BP_C_K2_OnLogout_Params
    {
    public:
        Engine::AController*                                         ExitingController;                                       //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramGameMode_BP_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramGameMode_BP_C_StartOnlineMatchOfType_Params
    {
    public:
        SportsScramble::EScramSport                                  SportType;                                               //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramGameMode_BP_C_ClientSportPreferencesReceived_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramGameMode_BP_C_K2_PostLogin_Params
    {
    public:
        Engine::APlayerController*                                   NewPlayer;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramGameMode_BP_C_SpawnOnlineGameHandler_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramGameMode_BP_C_ExecuteUbergraph_ScramGameMode_BP_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramGameMode_BP_C_ClientPlayerExit__DelegateSignature_Params
    {
    public:
        Engine::AController*                                         ExitingPlayer;                                           //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         IsSpectator;                                             //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AScramGameMode_BP_C_NewPlayerJoin__DelegateSignature_Params
    {
    public:
        Engine::APlayerController*                                   NewPlayer;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         IsSpectator;                                             //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
