#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FName.h"
#include "BasicTypes_FText.h"
#include "BasicTypes_UScriptDelegate.h"
#include "BasicTypes_TArray.h"
#include "SportsScramble_FScramFriend.h"
#include "SportsScramble_FScramGameInvite.h"
#include "GameModeTypes_ENUMS.h"
#include "SportsScramble_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Menu_QpDetails { class AMenu_QpDetails_C; };
namespace CG::Engine { class UTexture2D; };
namespace CG::Menu_GameDetails { class AMenu_GameDetails_C; };
namespace CG::Menu_SportOptions { class AMenu_SportOptions_C; };
namespace CG::Menu_TextTwo { class AMenu_TextTwo_C; };
namespace CG::Engine { class UTexture; };
namespace CG::Menu_Feathered { class AMenu_Feathered_C; };
namespace CG::Menu_IndexSelection { class AMenu_IndexSelection_C; };
namespace CG::Menu_PanelImages { class AMenu_PanelImages_C; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::SelectionDetailsMenu
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_FailsafeDoubleMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnConfirmationMenu_Params
    {
    public:
        BasicTypes::FName                                            LocText;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FText                                            OverrideText;                                            //  0x0008(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0020(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnJoinInviteMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  JoinEvent;                                               //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        BasicTypes::UScriptDelegate                                  DismissEvent;                                            //  0x0010(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnQpDetailsMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  EditEvent;                                               //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        BasicTypes::UScriptDelegate                                  SpawnNavEvent;                                           //  0x0010(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        Menu_QpDetails::AMenu_QpDetails_C*                           Menu;                                                    //  0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_UpdateTeamColor_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnEditAvatarMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnAvatarButton_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  AvatarEvent;                                             //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnInfoButton_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnTrainingOptionsMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnFriendListMenu_Params
    {
    public:
        BasicTypes::TArray<SportsScramble::FScramFriend>             FriendsList;                                             //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        BasicTypes::TArray<SportsScramble::FScramGameInvite>         InviteList;                                              //  0x0010(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        BasicTypes::UScriptDelegate                                  InviteEvent;                                             //  0x0020(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        BasicTypes::UScriptDelegate                                  JoinEvent;                                               //  0x0030(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        BasicTypes::UScriptDelegate                                  FailEvent;                                               //  0x0040(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnMessageMenu_Params
    {
    public:
        BasicTypes::FText                                            Message;                                                 //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        int32_t                                                      TimerDisplay;                                            //  0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnChooseSportsMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  UpdateButtonEvent;                                       //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_Spawn3DImageButtonMenu_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FName>                        LocTextNames;                                            //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        BasicTypes::TArray<Engine::UTexture2D*>                      ImagesL;                                                 //  0x0010(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        BasicTypes::TArray<Engine::UTexture2D*>                      ImagesR;                                                 //  0x0020(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0030(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_AwardsEarned_Params
    {
    public:
        bool                                                         AwardWaiting;                                            //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnTrophyAvatarNotification_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  AwardReadyEvent;                                         //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnResultsMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  ResultsCompleteEvent;                                    //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnGameDetailsMenu_Params
    {
    public:
        GameModeTypes::EGameModeTypes                                Mode;                                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Menu_GameDetails::AMenu_GameDetails_C*                       Menu;                                                    //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnSportOptionsMenu_Params
    {
    public:
        Menu_SportOptions::AMenu_SportOptions_C*                     Menu;                                                    //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0003[0x8];                                   //  0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnPnpWinner_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnTextTwoMenu_Params
    {
    public:
        BasicTypes::FName                                            LocText0;                                                //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            LocText1;                                                //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0010(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        Menu_TextTwo::AMenu_TextTwo_C*                               Menu;                                                    //  0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_GetAllPnpGameData_Params
    {
    public:
        BasicTypes::TArray<Engine::UTexture2D*>                      ImageList;                                               //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor)
        BasicTypes::TArray<BasicTypes::FText>                        TitleList;                                               //  0x0010(0x0010)  (Parm, OutParm, ZeroConstructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnFeatherMenu_Params
    {
    public:
        BasicTypes::TArray<Engine::UTexture*>                        Textures;                                                //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        BasicTypes::TArray<BasicTypes::FText>                        Texts;                                                   //  0x0010(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        int32_t                                                      StartIndex;                                              //  0x0020(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0004[0x4];                                   //  0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0028(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        Menu_Feathered::AMenu_Feathered_C*                           Menu;                                                    //  0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnPlayerCountMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_EnableActiveMenuInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_DisableActiveMenuInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnHeader_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  FirstMenu;                                               //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_GetNextGame_Params
    {
    public:
        BasicTypes::FName                                            NextGame;                                                //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_UnbindFromPause_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ShowMenus_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_HideMenus_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ProcessResultsData_Params
    {
    public:
        bool                                                         ExitedEarly;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_HasOptionsMenu_Params
    {
    public:
        BasicTypes::FName                                            Game;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         HasOptionMenu;                                           //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0005[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_GetSpawnOverride_Params
    {
    public:
        BasicTypes::FName                                            SpawnOverride;                                           //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnIndexButtonMenu_Params
    {
    public:
        GameModeTypes::EGameModeTypes                                Mode;                                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::EScramSport                                  Sport;                                                   //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0006[0x6];                                   //  0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::UScriptDelegate                                  Link;                                                    //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        Menu_IndexSelection::AMenu_IndexSelection_C*                 Menu;                                                    //  0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_NextMenu_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnImageButtonMenu_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FName>                        LocTextNames;                                            //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        BasicTypes::TArray<Engine::UTexture2D*>                      Images;                                                  //  0x0010(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        BasicTypes::UScriptDelegate                                  Event;                                                   //  0x0020(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        Menu_PanelImages::AMenu_PanelImages_C*                       MenuActor;                                               //  0x0030(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TypicalButtonSetup_Params
    {
    public:
        bool                                                         Back;                                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Replay;                                                  //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Ok;                                                      //  0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Play;                                                    //  0x0003(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Next;                                                    //  0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         WideSpacing;                                             //  0x0005(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0007[0x2];                                   //  0x0006(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::UScriptDelegate                                  LeftEvent;                                               //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        BasicTypes::UScriptDelegate                                  RightEvent;                                              //  0x0018(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        BasicTypes::UScriptDelegate                                  NextEvent;                                               //  0x0028(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        bool                                                         Home;                                                    //  0x0038(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Trophy;                                                  //  0x0039(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0008[0x6];                                   //  0x003A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_RemoveNavigationButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_Cleanup_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnNavigationButtons_Params
    {
    public:
        bool                                                         Left;                                                    //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Right;                                                   //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0009[0x6];                                   //  0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FText                                            LeftButtonText;                                          //  0x0008(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        BasicTypes::FText                                            RightButtonText;                                         //  0x0020(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        bool                                                         WideSpacing;                                             //  0x0038(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Replay;                                                  //  0x0039(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0010[0x6];                                   //  0x003A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::UScriptDelegate                                  LeftEvent;                                               //  0x0040(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        BasicTypes::UScriptDelegate                                  RightEvent;                                              //  0x0050(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        BasicTypes::UScriptDelegate                                  NextEvent;                                               //  0x0060(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
        bool                                                         Home;                                                    //  0x0070(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Next;                                                    //  0x0071(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Trophy;                                                  //  0x0072(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_UpdateTitleText_Params
    {
    public:
        BasicTypes::FText                                            Text;                                                    //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_Timeline_MenuScale__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_Timeline_MenuScale__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnFailure_FE43AE584DB619A31AB35583046C6A27_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnSuccess_FE43AE584DB619A31AB35583046C6A27_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnFailure_CB7A18C444F2E804805EC3A046AC96DF_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnSuccess_CB7A18C444F2E804805EC3A046AC96DF_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnFailure_FE43AE584DB619A31AB3558304ED0BB9_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnSuccess_FE43AE584DB619A31AB3558304ED0BB9_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnFailure_CB7A18C444F2E804805EC3A0CE7B06EC_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnSuccess_CB7A18C444F2E804805EC3A0CE7B06EC_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnCancel_D21648FA4F7680E39E435BB326E4A1A7_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnTimeout_D21648FA4F7680E39E435BB326E4A1A7_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnFailure_D21648FA4F7680E39E435BB326E4A1A7_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnSuccessClient_D21648FA4F7680E39E435BB326E4A1A7_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnSuccessHost_D21648FA4F7680E39E435BB326E4A1A7_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnFailure_B603128B47FD5879018CB5924F266D10_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnSuccess_B603128B47FD5879018CB5924F266D10_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnFailure_FC682A0844206A0687EAD6A05F2DED23_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnSuccess_FC682A0844206A0687EAD6A05F2DED23_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnFailure_D2DF35C34C56D5F01118B9942CE1DB3F_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnSuccess_D2DF35C34C56D5F01118B9942CE1DB3F_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnFailure_FE43AE584DB619A31AB355838CBBFA14_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnSuccess_FE43AE584DB619A31AB355838CBBFA14_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnFailure_CB7A18C444F2E804805EC3A028C7872D_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnSuccess_CB7A18C444F2E804805EC3A028C7872D_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnFailure_FE43AE584DB619A31AB355836A077BD5_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnSuccess_FE43AE584DB619A31AB355836A077BD5_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnFailure_CB7A18C444F2E804805EC3A0462DF741_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnSuccess_CB7A18C444F2E804805EC3A0462DF741_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreateResultsOnline_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreateOnlineMatchTypeMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_BackFromOnlineMatchType_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnlineGameTypeChosen_Params
    {
    public:
        int32_t                                                      Index;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnFindMatchChooseSport_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnCheckingForFriendsMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnlineMatchTypeReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_FindMatchMenuReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_PlayWithFriendsReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_UpdateNextButton_Params
    {
    public:
        bool                                                         EnableButton;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreateCheckingForPlayers_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_StartFindMatchMatchmaking_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnFriendsListMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_InviteFriendSelected_Params
    {
    public:
        SportsScramble::FScramFriend                                 InvitePlayer;                                            //  0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_JoinFriendSelected_Params
    {
    public:
        SportsScramble::FScramGameInvite                             JoinPlayer;                                              //  0x0000(0x0060)  (BlueprintVisible, BlueprintReadOnly, Parm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_FriendsListDisplayed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_FailedConnection_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_FindMatchFailedMessageReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OnGetFriends_Params
    {
    public:
        bool                                                         wasSuccessful;                                           //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0011[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<SportsScramble::FScramFriend>             friends;                                                 //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_InvitesChecked_Params
    {
    public:
        bool                                                         wasSuccessful;                                           //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0012[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<SportsScramble::FScramGameInvite>         invites;                                                 //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_InvitingFriendMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_InvitingMessageDisplayed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ShowJoiningMatchMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_JoinMatchMenuReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_PreparingJoinFindMatch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ClientJoinFriend_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ExitFailMessage_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CancelInvite_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CancelFindMatch_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_BackToChooseOnlineType_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SportsPoolSelected_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TimedOut_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_RefreshFailed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreateJoinInviteMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_InvitesDismissed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_QuickMatchTurnAround_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnQuickMatchTurnAround_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_QuickMatchTurnAroundCompleted_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TurnAroundHostFriend_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnTurnAroundHostFriend_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_HostFriendTurnAroundComplete_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TurnAroundJoinMatch_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnTurnAroundJoinMatch_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_JoinMatchTurnAroundComplete_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TimedOutSelectionMade_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnInviteCancelledMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_InviteCancelledMessageDisplayed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_NoInternet_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_NewInviteReceived_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_NewInviteCollected_Params
    {
    public:
        bool                                                         wasSuccessful;                                           //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0013[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<SportsScramble::FScramGameInvite>         invites;                                                 //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ClientInviteJoinFailed_Params
    {
    public:
        SportsScramble::EScramPendingGameFailure                     failureType;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ClientUnrealJoinFailedMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ServerInviteJoinFailed_Params
    {
    public:
        SportsScramble::EScramPendingGameFailure                     failureType;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_UnrealConnectionFailed_Params
    {
    public:
        SportsScramble::EScramPendingGameFailure                     FailureType;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_UnrealConnectionFailedMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_UnrealConnectedFailedExit_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ServerUnrealJoinFailedMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreateResultsPnpQuickPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreateResultsPnPTournament_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreatePnpPlayerCountMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreatePnPGameType_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreatePnpTournamentCountMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_PnpQuickPlayGameSelection_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_StartTournament_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_PnPStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_tempEvent_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_PvpMenuReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_PnpGameTypeReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TournamentCountReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_PnpSelectionReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_PnpQuickPlaySelectionMade_Params
    {
    public:
        int32_t                                                      Index;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_PnpGameTypeChosen_Params
    {
    public:
        int32_t                                                      Index;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_PnpResultsDisplayed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_BackToPlayerCountMenu_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_BackToPnpGameType_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_BackToMultiplayerMode_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_PlayerCountComplete_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreateSportModeMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreateResultsSportQuickplay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreateResultsTraining_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreateResultsChallenge_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SportModeSelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnQpInfoMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnTrainingSelectionMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnChallengesSelectionMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnGameInfoScreen_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnTrainingOptions_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SportMenuModeReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SelectionMenuReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_QuickPlaySetupReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_GameInfoReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TrainingOptionsReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_GameSelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0014[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FName                                            GameName;                                                //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_FinishTrainingOrChallenge_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_FinishQuickplay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ToggleChallengeInfo_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_BackToSportModeMenu_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_PlayQuickPlay_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ReturnToSportOptionMenu_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_BackToGameSelection_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_StartTrainingOrChallenge_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_BackToGameInfoScreen_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TrainingOptionsSet_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ResultsReady_Params
    {
    public:
        bool                                                         WideNextButton;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ResultsDisplayComplete_Params
    {
    public:
        bool                                                         WideNextButton;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_FadeToThemeMusic_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SportOptionAvatarButtonUsed_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SportOptionEditAvatar_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SportOptionEditAvatarOpened_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SportOptionEditAvatarComplete_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SportModeAvatarButtonUsed_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SportModeEditAvatar_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SportModeEditAvatarOpened_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SportModeEditAvatarComplete_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SelectionMenuAvatarButtonUsed_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SelectionMenuEditAvatar_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SelectionMenuEditAvatarOpened_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SelectionMenuEditAvatarComplete_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_GameInfoAvatarButtonUsed_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_GameInfoEditAvatar_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_GameInfoEditAvatarOpened_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_GameInfoEditAvatarComplete_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TrainingOptionsAvatarButtonUsed_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TrainingOptionsEditAvatar_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TrainingOptionsEditAvatarOptions_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TrainingOptionsEditAvatarComplete_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_EditSportOptionsSelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnQpDetailsNavButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SpawnSportOptionMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_BackToQpInfo_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OpenFirstMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_InitialMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CloseMenu_Params
    {
    public:
        bool                                                         QuitButtonPressed;                                       //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreateMultiplayerModeMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_MultiplayerModeSelected_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ReturnToCenter_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CapsuleOn_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_GamePaused_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_GameUnpaused_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_HeaderDestroyed_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ScaleUpMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ScaleDownMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ButtonPressed_Params
    {
    public:
        int32_t                                                      ID;                                                      //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_MultiplayerModeReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_RemoveLastMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_FinalShutdown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TrophyComplete_Params
    {
    public:
        bool                                                         AllAwardsComplete;                                       //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CreateTrophyMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TrophyLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_CloseMenuWithHeaderHandoff_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_DestroyMenuWithHandoff_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SkipResults_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_QuitButtonPressed_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_TrophyReadyToSpawn_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_NextMenuEarlyExit_Params
    {
    public:
        int32_t                                                      ButtonId;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_PlayerTurnedAround_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_RecenterMenu_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_Create_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_InviteUpdateComplete_Params
    {
    public:
        bool                                                         wasSuccessful;                                           //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0015[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<SportsScramble::FScramGameInvite>         invites;                                                 //  0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_WaitForInvitesUpdateComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_ExecuteUbergraph_SelectionDetailsMenu_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0016[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_InvitesUpdated__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_MenuOpened__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_SelectionComplete__DelegateSignature_Params
    {
    public:
        SportsScramble::EScramSport                                  Sport;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         SinglePlayer;                                            //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_OldMenuClear__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ASelectionDetailsMenu_C_QuitToMainMenu__DelegateSignature_Params
    {
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
