#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::SportsScramble { class AScramBall; };
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::ServeLauncher
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_UpdatePostionsMoveAnimation_Params
    {
    public:
        float                                                        AlphaValue;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_RemoveInstructions_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_SpawnInstructions_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_SetupBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_OnRep_Ball_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_SetTNBallScale_Params
    {
    public:
        SportsScramble::AScramBall*                                  TNScramBall;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_Timeline_Spin__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_Timeline_Spin__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_Timeline_Bobble__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_Timeline_Bobble__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_Timeline_Rise__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_Timeline_Rise__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_LauncherGrowShrink__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_LauncherGrowShrink__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_ScaleBallUpDown__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_ScaleBallUpDown__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_Timeline_DelayHack__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_Timeline_DelayHack__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_Timeline_MoveToSide__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_Timeline_MoveToSide__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_Timeline_SpeedHack__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_Timeline_SpeedHack__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_MoveBallToServePosition_Params
    {
    public:
        float                                                        FloorHeight;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         Player1Serve;                                            //  0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_GentleBallSpin_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_BobbleBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_BallGrabbed_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_ReleaseBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_StartRise_Params
    {
    public:
        float                                                        FloorHeight;                                             //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_StopRise_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_LauncherGrow_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_LauncherShrink_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_ScaleBallUp_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_SetupGraphics_Params
    {
    public:
        bool                                                         Player1Serve;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_DoneGrowing_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_TeeBallHit_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_DisableHitMe_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_BallHit_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_MoveTest_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_SpeedHack_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_AllowHit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_GrabbedBallHit_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_CheckIfShouldResetBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_GrabbedBallGrabbed_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_ResetBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_ExecuteUbergraph_ServeLauncher_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLauncher_C_OnBallHit__DelegateSignature_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
