#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AActor; };
namespace CG::SportsScramble { class AScramBall; };
namespace CG::SportsScramble { class AScramPlayer; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::ServeLocationIndicator
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AServeLocationIndicator_C_ResetBall_Params
    {
    public:
        Engine::AActor*                                              Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLocationIndicator_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLocationIndicator_C_Show_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLocationIndicator_C_Hide_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLocationIndicator_C_ServeBallGrabbed_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLocationIndicator_C_ServeBallSpawned_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLocationIndicator_C_OnPlayerEnter_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLocationIndicator_C_OnPlayerExit_Params
    {
    public:
        SportsScramble::AScramPlayer*                                Player;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLocationIndicator_C_AttractLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLocationIndicator_C_StopAttract_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLocationIndicator_C_ExecuteUbergraph_ServeLocationIndicator_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLocationIndicator_C_BallSpawned__DelegateSignature_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AServeLocationIndicator_C_BallGrabbed__DelegateSignature_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
