#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "TN_Training_ScrambleTargets_ENUMS.h"
#include "CoreUObject_FTransform.h"
#include "BasicTypes_TArray.h"
#include "ScramblerTargetSet_FScramblerTargetSet.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::ScrambleEvent_Base { class AScrambleEvent_Base_C; };
namespace CG::Engine { class UTexture2D; };
namespace CG::TN_Ball_Base { class ATN_Ball_Base_C; };
namespace CG::TN_Instrument_Base { class ATN_Instrument_Base_C; };
namespace CG::TennisScrambleTarget { class ATennisScrambleTarget_C; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::TennisTrainingScrambleTargetGroup
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_RemoveGameElement_Params
    {
    public:
        bool                                                         Removed;                                                 //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_RemoveAllDemoTargets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_TennisTrainingSingleScrambleTarget_Params
    {
    public:
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   TargetClass;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        TN_Training_ScrambleTargets::ETN_Training_ScrambleTargets    TargetLocation;                                          //  0x000C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_RemovePairTargets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTrainingTargetPair_Params
    {
    public:
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   TargetClass;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x4];                                   //  0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::UTexture2D*                                          Icon;                                                    //  0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        TN_Training_ScrambleTargets::ETN_Training_ScrambleTargets    Position;                                                //  0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTrainingTargetClass_Params
    {
    public:
        CoreUObject::FTransform                                      Transform;                                               //  0x0000(0x0030)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   TargetClass;                                             //  0x0030(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x4];                                   //  0x003C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_FilterScrambleSet_Params
    {
    public:
        BasicTypes::TArray<ScramblerTargetSet::FScramblerTargetSet>  ScramblerTargetSet;                                      //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
        BasicTypes::TArray<ScramblerTargetSet::FScramblerTargetSet>  FilteredTargetSet;                                       //  0x0010(0x0010)  (Parm, OutParm, ZeroConstructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpecificBallActivated_Params
    {
    public:
        TN_Ball_Base::ATN_Ball_Base_C*                               BallClass;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_GetValidSpecificBalls_Params
    {
    public:
        BasicTypes::TArray<TN_Ball_Base::ATN_Ball_Base_C*>           BallDistibutionList;                                     //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpecificInstrumentActivated_Params
    {
    public:
        TN_Instrument_Base::ATN_Instrument_Base_C*                   InstrumentClass;                                         //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_GetValidSpecificInstruments_Params
    {
    public:
        BasicTypes::TArray<TN_Instrument_Base::ATN_Instrument_Base_C*> ValidInstruments;                                        //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_RemoveAllNetNotifiers_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SetSpawnLocsForReinforcements_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_UpdateTennisManagerVars_Params
    {
    public:
        int32_t                                                      Game;                                                    //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Point;                                                   //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_RemoveAllTargets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_GetActiveTargetsByClass_Params
    {
    public:
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   ScrambleEventClass;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      Count;                                                   //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_GetWeightedClassList_Params
    {
    public:
        BasicTypes::TArray<ScrambleEvent_Base::AScrambleEvent_Base_C*> WeightedList;                                            //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_DisableScrambleEventType_Params
    {
    public:
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   EventClass;                                              //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_RemoveDisabledSpawnLocations_Params
    {
    public:
        BasicTypes::TArray<int32_t>                                  ValidSpawnLocations;                                     //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_DisableSpawnLocations_Params
    {
    public:
        BasicTypes::TArray<int32_t>                                  DisabledLocations;                                       //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnInitial_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnRandom_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTarget_Params
    {
    public:
        CoreUObject::FTransform                                      Transform;                                               //  0x0000(0x0030)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
        int32_t                                                      ID;                                                      //  0x0030(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0003[0x4];                                   //  0x0034(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   ScrambleClass;                                           //  0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_RespawnLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_TargetDespawned_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_ScrambleTargetRemoved_Params
    {
    public:
        TennisScrambleTarget::ATennisScrambleTarget_C*               TargetActor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   ScrambleEvent;                                           //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_TargetHit_Params
    {
    public:
        TennisScrambleTarget::ATennisScrambleTarget_C*               TargetActor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   ScrambleEvent;                                           //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetRight_Basketball_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetLeft_RandRacket_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetCenter_NetRaise_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetLeft_Basketball_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetRight_SoccerBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetLeft_GolfBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetRight_Chicken_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetLeft_Basketball_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetRight_Bat_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_TargetFiredBall_Params
    {
    public:
        TN_Ball_Base::ATN_Ball_Base_C*                               BallFired;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetLeft_PoolNoodle_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetRight_FoamFinger_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetLeft_FloppyFish_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnOneOfScrambleTargetPair_Params
    {
    public:
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   TargetClass;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0004[0x4];                                   //  0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::UTexture2D*                                          Icon;                                                    //  0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        TN_Training_ScrambleTargets::ETN_Training_ScrambleTargets    Position;                                                //  0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetLeft_Baseball_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetLeft_Bat_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetRight_Baseball_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetLeft_FoamFinger_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetLeft_BeachBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetRight_Paddle_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetLeft_PingPongBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetRight_PoolNoodle_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetLeft_HockeyStick_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetCenter_GolfClub_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnTargetRight_TennisRacket_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetLeft_TennisRacket_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetRight_HockeyStick_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetCenter_Basketball_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetLeft_Frisbee_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetRight_PingPongBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetRight_Frisbee_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetLeft_PingPongBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetCenter_TennisBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_SpawnDemoTargetLeft_HockeyPuck_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_ExecuteUbergraph_TennisTrainingScrambleTargetGroup_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0005[0xC];                                   //  0x0004(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_TargetHasBeenHit__DelegateSignature_Params
    {
    public:
        TennisScrambleTarget::ATennisScrambleTarget_C*               TargetActor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   EventClass;                                              //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      TargetId;                                                //  0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisTrainingScrambleTargetGroup_C_BallHasBeenFiredByTarget__DelegateSignature_Params
    {
    public:
        TN_Ball_Base::ATN_Ball_Base_C*                               LaunchedBall;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
