#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_TArray.h"
#include "SportsScramble_ENUMS.h"
#include "Engine_ENUMS.h"
#include "SportsScramble_FScramTrajectory.h"
#include "CoreUObject_FRotator.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::TN_Ball_Base { class ATN_Ball_Base_C; };
namespace CG::TN_Instrument_Base { class ATN_Instrument_Base_C; };
namespace CG::Engine { class UTexture2D; };
namespace CG::SportsScramble { class AScramBall; };
namespace CG::TennisScrambleTarget { class ATennisScrambleTarget_C; };
namespace CG::ScrambleEvent_Base { class AScrambleEvent_Base_C; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::TennisScrambleTarget
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_RemoveGameElement_Params
    {
    public:
        bool                                                         Removed;                                                 //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_SpawnScrambleEffect_Params
    {
    public:
        TN_Ball_Base::ATN_Ball_Base_C*                               Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x8];                                   //  0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_SetupNewTarget_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_DisableIcon_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_RemoveOldBall_Params
    {
    public:
        TN_Ball_Base::ATN_Ball_Base_C*                               Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_GetExistingSubclasses_Params
    {
    public:
        BasicTypes::TArray<TN_Ball_Base::ATN_Ball_Base_C*>           ActiveBallClasses;                                       //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor)
        BasicTypes::TArray<TN_Instrument_Base::ATN_Instrument_Base_C*> ActiveInstrumentClasses;                                 //  0x0010(0x0010)  (Parm, OutParm, ZeroConstructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_GetAiValue_Params
    {
    public:
        SportsScramble::EScrambleTargetAiValue                       Value;                                                   //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_GetRandomRacketType_Params
    {
    public:
        Engine::UTexture2D*                                          ScrambleIcon;                                            //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_GetRandomBallType_Params
    {
    public:
        Engine::UTexture2D*                                          ScrambleIcon;                                            //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_Timeline_Size_Change__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_Timeline_Size_Change__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_Timeline_RotateCannon__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_Timeline_RotateCannon__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_Timeline_SpinCannon__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_Timeline_SpinCannon__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_Grow_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_Shrink_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_OnTriggered_Params
    {
    public:
        SportsScramble::AScramBall*                                  Ball;                                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_SetupCannon_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_FireCannon_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_RotateCannon_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_SpinCannon_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_FireFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_ApplyCannonRotation_Params
    {
    public:
        SportsScramble::FScramTrajectory                             trajectory;                                              //  0x0000(0x01F0)  (BlueprintVisible, BlueprintReadOnly, Parm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_SetCannonRotation_Params
    {
    public:
        CoreUObject::FRotator                                        Rotation;                                                //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_ExecuteUbergraph_TennisScrambleTarget_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_BallFiredFromTarget__DelegateSignature_Params
    {
    public:
        TN_Ball_Base::ATN_Ball_Base_C*                               BallFired;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_ScrambleTargetHit__DelegateSignature_Params
    {
    public:
        TennisScrambleTarget::ATennisScrambleTarget_C*               TargetActor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   ScrambleEvent;                                           //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATennisScrambleTarget_C_ScrambleTargetRemoved__DelegateSignature_Params
    {
    public:
        TennisScrambleTarget::ATennisScrambleTarget_C*               TargetActor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   ScrambleEvent;                                           //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
