#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "CoreUObject_FVector.h"
#include "SportsScramble_ENUMS.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class AActor; };
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::TN_Ball_Base
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlaySliceSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlayHitNetSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlayEnvironmentBounceSound_Params
    {
    public:
        CoreUObject::FVector                                         Normal;                                                  //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_LocalPlayerInstrumentImpactFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlayNormalHitFX_Params
    {
    public:
        Engine::AActor*                                              GrabberActor;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlayChargeSliceBounceFX_Params
    {
    public:
        CoreUObject::FVector                                         Normal;                                                  //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        CoreUObject::FVector                                         Location;                                                //  0x000C(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlayNormalBounceFX_Params
    {
    public:
        CoreUObject::FVector                                         Normal;                                                  //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        CoreUObject::FVector                                         Location;                                                //  0x000C(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlayChargeBounceFX_Params
    {
    public:
        CoreUObject::FVector                                         Normal;                                                  //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        CoreUObject::FVector                                         Location;                                                //  0x000C(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlaySliceBounceFX_Params
    {
    public:
        CoreUObject::FVector                                         Normal;                                                  //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        CoreUObject::FVector                                         Location;                                                //  0x000C(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_StopAllShotTypeFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_StopChargedSliceFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlayChargedSliceFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_StopSliceFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlaySliceFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_StopChargedFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlayChargedFX_Params
    {
    public:
        bool                                                         NoHitSFX;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_StopImbuedFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlayImbuedFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlayDespawnFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_PlaySpawnFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_SetTrail_Params
    {
    public:
        SportsScramble::ETennisShotType                              ShotType;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         NoHitSFX;                                                //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_ClearTrail_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_BallVanish_Params
    {
    public:
        bool                                                         playOut;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_BallHit_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_BallGrabbed_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_OnShotChanged_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_ReceiveTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_DestroyPrimitive_Params
    {
    public:
        bool                                                         playOut;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        Delay;                                                   //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_NetPlayImbuedFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_NetStopImbuedFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_ExecuteUbergraph_TN_Ball_Base_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Ball_Base_C_BallShotTypeChange__DelegateSignature_Params
    {
    public:
        SportsScramble::ETennisShotType                              ShotType;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
