#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "CoreUObject_FTransform.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::ScrambleEvent_Base { class AScrambleEvent_Base_C; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::TN_PassNPlay_ScrambleTargetGroup
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_RemoveGameElement_Params
    {
    public:
        bool                                                         Removed;                                                 //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_SpawnIcon_Ball_Params
    {
    public:
        CoreUObject::FTransform                                      Transform;                                               //  0x0000(0x0030)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
        int32_t                                                      ID;                                                      //  0x0030(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x4];                                   //  0x0034(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   ScrambleClass;                                           //  0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_RemoveAllTargets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_SpawnIcon_Instrument_Params
    {
    public:
        CoreUObject::FTransform                                      Transform;                                               //  0x0000(0x0030)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
        int32_t                                                      ID;                                                      //  0x0030(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x4];                                   //  0x0034(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   ScrambleClass;                                           //  0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_RotateBall__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_RotateBall__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_RotateInstrument__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_RotateInstrument__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_RotateBallIcon_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_RotateInstrumentIcon_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_StopBallIcon_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_StopInstrumentIcon_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_PassNPlay_ScrambleTargetGroup_C_ExecuteUbergraph_TN_PassNPlay_ScrambleTargetGroup_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
