#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "SlateCore_FSlateColor.h"
#include "CoreUObject_FVector.h"
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::CoreUObject { class UObject; };
namespace CG::SportsScramble { class UScramEventBasePayload; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::TN_ReturnWall
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_FlashScore_Params
    {
    public:
        int32_t                                                      score;                                                   //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        SlateCore::FSlateColor                                       Color;                                                   //  0x0008(0x0028)  (BlueprintVisible, BlueprintReadOnly, Parm)
        bool                                                         ScoreFlashed;                                            //  0x0030(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_HideBallTarget_Params
    {
    public:
        bool                                                         Instant;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Callback;                                                //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_ShowBallTarget_Params
    {
    public:
        bool                                                         Instant;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         Callback;                                                //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_RemoveGameElement_Params
    {
    public:
        bool                                                         Removed;                                                 //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_AreStreaksContinued_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_GetFlyTextTransform_Params
    {
    public:
        CoreUObject::FVector                                         Location;                                                //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x4];                                   //  0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_RemoveImpacts_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_CreateImpact_Params
    {
    public:
        CoreUObject::FVector                                         Location;                                                //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_Timeline_Move__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_Timeline_Move__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_Timeline_FirstResize__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_Timeline_FirstResize__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_Timeline_SecondResize__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_Timeline_SecondResize__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_Timeline_ThirdResize__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_Timeline_ThirdResize__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_Timeline_ResetOriginalSize__FinishedFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_Timeline_ResetOriginalSize__UpdateFunc_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_RiseUp_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_LowerDown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_TargetHit_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        SportsScramble::UScramEventBasePayload*                      Payload;                                                 //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_CalculateStreakHits_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_CalculateCumulativeHits_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_FirstResize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_SecondResize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_ThirdResize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_ResetOriginalSize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_CalculateStreakMultiplier_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_TargetMaterialFlash_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_ExecuteUbergraph_TN_ReturnWall_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_ReturnWall_C_ReturnWallHit__DelegateSignature_Params
    {
    public:
        int32_t                                                      CurrentStreak;                                           //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
