#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::TennisScrambleTarget { class ATennisScrambleTarget_C; };
namespace CG::ScrambleEvent_Base { class AScrambleEvent_Base_C; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::TN_Train_05_ScrambleBalls
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_AdjustScramTargetInfluencers_Params
    {
    public:
        TennisScrambleTarget::ATennisScrambleTarget_C*               Target;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_UnbindEvents_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_SetUpInfoText_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_PreTrainingGameCountDown_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_CountDownCompleted_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_TN_LaunchedBallHit_Params
    {
    public:
        float                                                        HitLocationX;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        float                                                        HitLocationY;                                            //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_TN_LaunchedBallMissed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_LaunchNextBall_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_PreTrainingDialog_01_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_PreTrainingDialog_02_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_PreTrainingDialog_03_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_PreTrainingDialog_04_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_PreTrainingDialog_05_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_IntroTargetHit_Params
    {
    public:
        TennisScrambleTarget::ATennisScrambleTarget_C*               TargetActor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   ScrambleEvent;                                           //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_FirstTargetHit_Params
    {
    public:
        TennisScrambleTarget::ATennisScrambleTarget_C*               TargetActor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   ScrambleEvent;                                           //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_ScorePlayer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_FinalScore_Params
    {
    public:
        TennisScrambleTarget::ATennisScrambleTarget_C*               TargetActor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   ScrambleEvent;                                           //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_SecondScore_Params
    {
    public:
        TennisScrambleTarget::ATennisScrambleTarget_C*               TargetActor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   ScrambleEvent;                                           //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_ThirdScore_Params
    {
    public:
        TennisScrambleTarget::ATennisScrambleTarget_C*               TargetActor;                                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        ScrambleEvent_Base::AScrambleEvent_Base_C*                   ScrambleEvent;                                           //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      ID;                                                      //  0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_NotifyTrainingContinue_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_AnnouncerExitSequenceComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATN_Train_05_ScrambleBalls_C_ExecuteUbergraph_TN_Train_05_ScrambleBalls_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
