#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_TArray.h"
#include "BasicTypes_FName.h"
#include "BasicTypes_FText.h"
#include "Engine_ENUMS.h"
#include "ResultsData_FResultsData.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Countdown { class ACountdown_C; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::TrainingBase
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_StopFlashButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_FlashButtons_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_HasPlayerCompletedTrainingRoomPreviously_Params
    {
    public:
        bool                                                         AlreadyCompleted;                                        //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_DestroyAllBalls_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_TrainingBaseInitialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_CleanUpGameElements_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_SpawnCountDown_Params
    {
    public:
        Countdown::ACountdown_C*                                     CountdownActor;                                          //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_SpawnAnnouncerActor_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FName>                        AnnouncerAudioList;                                      //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_SpawnPopupInfo_Params
    {
    public:
        BasicTypes::FText                                            Text;                                                    //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        float                                                        DisplayTime;                                             //  0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_AnnouncerReady_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_ClosingAnnouncerComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_DisplayStartOfMatchInfo_Params
    {
    public:
        bool                                                         FadeInOutMusic;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_EndOfGame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_MusicFadeOut_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_MusicFadeIn_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_NotifyTrainingContinue_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_AnnouncerPairedComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_AnnouncerExitSequenceComplete_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_HandleSuccess_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_HandleFailure_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_ReceiveEndPlay_Params
    {
    public:
        Engine::EEndPlayReason                                       EndPlayReason;                                           //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_ExecuteUbergraph_TrainingBase_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ATrainingBase_C_TrainingComplete__DelegateSignature_Params
    {
    public:
        ResultsData::FResultsData                                    Results;                                                 //  0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
