#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    10/14/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "InputCore_FKey.h"
#include "BasicTypes_FText.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::UMG { class UWidget; };
namespace CG::WB_KeyboardKeyWidget { class UWB_KeyboardKeyWidget_C; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::WB_KeyboardKeyWidget
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardKeyWidget_C_ToggleModifierKey_Params
    {
    public:
        InputCore::FKey                                              Modifier;                                                //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardKeyWidget_C_SetModifierKey_Params
    {
    public:
        InputCore::FKey                                              Modifier;                                                //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardKeyWidget_C_ToggleSecondaryKey_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardKeyWidget_C_Construct_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardKeyWidget_C_BndEvt__KeyButton_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardKeyWidget_C_BndEvt__KeyButton_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardKeyWidget_C_ExecuteUbergraph_WB_KeyboardKeyWidget_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardKeyWidget_C_KeyReleased__DelegateSignature_Params
    {
    public:
        BasicTypes::FText                                            KeyText;                                                 //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        UMG::UWidget*                                                KeyWidget;                                               //  0x0018(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        InputCore::FKey                                              Key;                                                     //  0x0020(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
        InputCore::FKey                                              Modifier;                                                //  0x0038(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardKeyWidget_C_KeyPressed__DelegateSignature_Params
    {
    public:
        BasicTypes::FText                                            KeyText;                                                 //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        WB_KeyboardKeyWidget::UWB_KeyboardKeyWidget_C*               KeyWidget;                                               //  0x0018(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        InputCore::FKey                                              Key;                                                     //  0x0020(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
        InputCore::FKey                                              Modifier;                                                //  0x0038(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
