#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    SportsScramble              |
 * | Version: 1                           |
 * | Date:    09/09/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FText.h"
#include "InputCore_FKey.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::WB_KeyboardKeyWidget { class UWB_KeyboardKeyWidget_C; };
namespace CG::UMG { class UWidget; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::WB_KeyboardWidget
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardWidget_C_Construct_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardWidget_C_Alpha_KeyPressed_Event_Params
    {
    public:
        BasicTypes::FText                                            KeyText;                                                 //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        WB_KeyboardKeyWidget::UWB_KeyboardKeyWidget_C*               KeyWidget;                                               //  0x0018(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        InputCore::FKey                                              Key;                                                     //  0x0020(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
        InputCore::FKey                                              Modifier;                                                //  0x0038(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardWidget_C_BndEvt__ShiftKey_K2Node_ComponentBoundEvent_0_KeyPressed__DelegateSignature_Params
    {
    public:
        BasicTypes::FText                                            KeyText;                                                 //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        WB_KeyboardKeyWidget::UWB_KeyboardKeyWidget_C*               KeyWidget;                                               //  0x0018(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        InputCore::FKey                                              Key;                                                     //  0x0020(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
        InputCore::FKey                                              Modifier;                                                //  0x0038(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardWidget_C_BndEvt__BackspaceKey_K2Node_ComponentBoundEvent_1_KeyPressed__DelegateSignature_Params
    {
    public:
        BasicTypes::FText                                            KeyText;                                                 //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        WB_KeyboardKeyWidget::UWB_KeyboardKeyWidget_C*               KeyWidget;                                               //  0x0018(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        InputCore::FKey                                              Key;                                                     //  0x0020(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
        InputCore::FKey                                              Modifier;                                                //  0x0038(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardWidget_C_KeyReleased_Event_1_Params
    {
    public:
        BasicTypes::FText                                            KeyText;                                                 //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        UMG::UWidget*                                                KeyWidget;                                               //  0x0018(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        InputCore::FKey                                              Key;                                                     //  0x0020(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
        InputCore::FKey                                              Modifier;                                                //  0x0038(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardWidget_C_BndEvt__SpacebarKey_K2Node_ComponentBoundEvent_50_KeyPressed__DelegateSignature_Params
    {
    public:
        BasicTypes::FText                                            KeyText;                                                 //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        WB_KeyboardKeyWidget::UWB_KeyboardKeyWidget_C*               KeyWidget;                                               //  0x0018(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        InputCore::FKey                                              Key;                                                     //  0x0020(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
        InputCore::FKey                                              Modifier;                                                //  0x0038(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardWidget_C_ExecuteUbergraph_WB_KeyboardWidget_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardWidget_C_KeyReleased__DelegateSignature_Params
    {
    public:
        BasicTypes::FText                                            Text;                                                    //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        InputCore::FKey                                              Key;                                                     //  0x0018(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
        InputCore::FKey                                              Modifier;                                                //  0x0030(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UWB_KeyboardWidget_C_KeyPressed__DelegateSignature_Params
    {
    public:
        BasicTypes::FText                                            Text;                                                    //  0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
        InputCore::FKey                                              Key;                                                     //  0x0018(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
        InputCore::FKey                                              Modifier;                                                //  0x0030(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
